cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
<?xml version="1.0" encoding="utf-8"?>

<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd" >
  <name>MAX32600</name>                                           <!-- name of part or part series -->
  <version>1.0</version>                                          <!-- version of this description -->
  <description>ARM 32-bit Cortex-M3 Microcontroller</description>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->

<peripherals>

<!-- GPIO:GPIO -->

<peripheral>
   <name>GPIO</name>
   <description>General Purpose I/O Ports (GPIO)</description>
   <groupName>GPIO</groupName>
   <baseAddress>0x40000000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- FREE_P0: Port P0 Free for GPIO Operation Flags -->
      <register>
         <name>FREE_P0</name>
         <description>Port P0 Free for GPIO Operation Flags</description>
         <addressOffset>0x0040</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P0.0 GPIO Mode Acknowledge </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P0.1 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P0.2 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P0.3 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P0.4 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P0.5 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P0.6 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P0.7 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- FREE_P1: Port P1 Free for GPIO Operation Flags -->
      <register>
         <name>FREE_P1</name>
         <description>Port P1 Free for GPIO Operation Flags</description>
         <addressOffset>0x0044</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P1.0 GPIO Mode Acknowledge </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P1.1 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P1.2 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P1.3 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P1.4 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P1.5 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P1.6 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P1.7 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

