cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- FREE_P7: Port P7 Free for GPIO Operation Flags -->
      <register>
         <name>FREE_P7</name>
         <description>Port P7 Free for GPIO Operation Flags</description>
         <addressOffset>0x005C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P7.0 GPIO Mode Acknowledge </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P7.1 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P7.2 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P7.3 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P7.4 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P7.5 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P7.6 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P7.7 GPIO Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- OUT_MODE_P0: Port P0 GPIO Output Drive Mode -->
      <register>
         <name>OUT_MODE_P0</name>
         <description>Port P0 GPIO Output Drive Mode</description>
         <addressOffset>0x0080</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P0.0 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P0.1 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P0.2 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P0.3 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P0.4 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P0.5 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P0.6 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P0.7 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_MODE_P1: Port P1 GPIO Output Drive Mode -->
      <register>
         <name>OUT_MODE_P1</name>
         <description>Port P1 GPIO Output Drive Mode</description>
         <addressOffset>0x0084</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P1.0 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P1.1 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P1.2 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P1.3 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P1.4 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P1.5 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P1.6 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P1.7 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_MODE_P2: Port P2 GPIO Output Drive Mode -->
      <register>
         <name>OUT_MODE_P2</name>
         <description>Port P2 GPIO Output Drive Mode</description>
         <addressOffset>0x0088</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P2.0 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P2.1 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P2.2 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P2.3 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P2.4 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P2.5 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P2.6 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P2.7 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_MODE_P3: Port P3 GPIO Output Drive Mode -->
      <register>
         <name>OUT_MODE_P3</name>
         <description>Port P3 GPIO Output Drive Mode</description>
         <addressOffset>0x008C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P3.0 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P3.1 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P3.2 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P3.3 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P3.4 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P3.5 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P3.6 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P3.7 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_MODE_P4: Port P4 GPIO Output Drive Mode -->
      <register>
         <name>OUT_MODE_P4</name>
         <description>Port P4 GPIO Output Drive Mode</description>
         <addressOffset>0x0090</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P4.0 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P4.1 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P4.2 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P4.3 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P4.4 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P4.5 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P4.6 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P4.7 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_MODE_P5: Port P5 GPIO Output Drive Mode -->
      <register>
         <name>OUT_MODE_P5</name>
         <description>Port P5 GPIO Output Drive Mode</description>
         <addressOffset>0x0094</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P5.0 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P5.1 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P5.2 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P5.3 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P5.4 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P5.5 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P5.6 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P5.7 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_MODE_P6: Port P6 GPIO Output Drive Mode -->
      <register>
         <name>OUT_MODE_P6</name>
         <description>Port P6 GPIO Output Drive Mode</description>
         <addressOffset>0x0098</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P6.0 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P6.1 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P6.2 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P6.3 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P6.4 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P6.5 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P6.6 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P6.7 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

