cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- OUT_MODE_P7: Port P7 GPIO Output Drive Mode -->
      <register>
         <name>OUT_MODE_P7</name>
         <description>Port P7 GPIO Output Drive Mode</description>
         <addressOffset>0x009C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P7.0 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P7.1 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P7.2 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P7.3 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P7.4 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P7.5 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P7.6 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P7.7 Output Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_VAL_P0: Port P0 GPIO Output Value -->
      <register>
         <name>OUT_VAL_P0</name>
         <description>Port P0 GPIO Output Value</description>
         <addressOffset>0x00C0</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P0.0 GPIO Output Drive Value </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P0.1 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P0.2 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P0.3 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P0.4 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P0.5 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P0.6 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P0.7 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_VAL_P1: Port P1 GPIO Output Value -->
      <register>
         <name>OUT_VAL_P1</name>
         <description>Port P1 GPIO Output Value</description>
         <addressOffset>0x00C4</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P1.0 GPIO Output Drive Value </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P1.1 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P1.2 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P1.3 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P1.4 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P1.5 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P1.6 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P1.7 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_VAL_P2: Port P2 GPIO Output Value -->
      <register>
         <name>OUT_VAL_P2</name>
         <description>Port P2 GPIO Output Value</description>
         <addressOffset>0x00C8</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P2.0 GPIO Output Drive Value </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P2.1 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P2.2 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P2.3 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P2.4 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P2.5 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P2.6 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P2.7 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_VAL_P3: Port P3 GPIO Output Value -->
      <register>
         <name>OUT_VAL_P3</name>
         <description>Port P3 GPIO Output Value</description>
         <addressOffset>0x00CC</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P3.0 GPIO Output Drive Value </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P3.1 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P3.2 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P3.3 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P3.4 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P3.5 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P3.6 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P3.7 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_VAL_P4: Port P4 GPIO Output Value -->
      <register>
         <name>OUT_VAL_P4</name>
         <description>Port P4 GPIO Output Value</description>
         <addressOffset>0x00D0</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P4.0 GPIO Output Drive Value </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P4.1 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P4.2 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P4.3 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P4.4 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P4.5 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P4.6 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P4.7 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

