cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- OUT_VAL_P5: Port P5 GPIO Output Value -->
      <register>
         <name>OUT_VAL_P5</name>
         <description>Port P5 GPIO Output Value</description>
         <addressOffset>0x00D4</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P5.0 GPIO Output Drive Value </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P5.1 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P5.2 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P5.3 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P5.4 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P5.5 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P5.6 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P5.7 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_VAL_P6: Port P6 GPIO Output Value -->
      <register>
         <name>OUT_VAL_P6</name>
         <description>Port P6 GPIO Output Value</description>
         <addressOffset>0x00D8</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P6.0 GPIO Output Drive Value </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P6.1 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P6.2 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P6.3 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P6.4 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P6.5 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P6.6 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P6.7 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OUT_VAL_P7: Port P7 GPIO Output Value -->
      <register>
         <name>OUT_VAL_P7</name>
         <description>Port P7 GPIO Output Value</description>
         <addressOffset>0x00DC</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P7.0 GPIO Output Drive Value </description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P7.1 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P7.2 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P7.3 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P7.4 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P7.5 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P7.6 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P7.7 GPIO Output Drive Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- FUNC_SEL_P0: Port P0 GPIO Function Select -->
      <register>
         <name>FUNC_SEL_P0</name>
         <description>Port P0 GPIO Function Select</description>
         <addressOffset>0x0100</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P0.0 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P0.1 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P0.2 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P0.3 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P0.4 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P0.5 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P0.6 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P0.7 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- FUNC_SEL_P1: Port P1 GPIO Function Select -->
      <register>
         <name>FUNC_SEL_P1</name>
         <description>Port P1 GPIO Function Select</description>
         <addressOffset>0x0104</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P1.0 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P1.1 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P1.2 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P1.3 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P1.4 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P1.5 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P1.6 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P1.7 Output Function Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

