cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- IN_MODE_P0: Port P0 GPIO Input Monitoring Mode -->
      <register>
         <name>IN_MODE_P0</name>
         <description>Port P0 GPIO Input Monitoring Mode</description>
         <addressOffset>0x0140</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P0.0 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P0.1 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P0.2 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P0.3 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P0.4 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P0.5 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P0.6 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P0.7 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- IN_MODE_P1: Port P1 GPIO Input Monitoring Mode -->
      <register>
         <name>IN_MODE_P1</name>
         <description>Port P1 GPIO Input Monitoring Mode</description>
         <addressOffset>0x0144</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P1.0 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P1.1 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P1.2 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P1.3 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P1.4 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P1.5 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P1.6 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P1.7 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- IN_MODE_P2: Port P2 GPIO Input Monitoring Mode -->
      <register>
         <name>IN_MODE_P2</name>
         <description>Port P2 GPIO Input Monitoring Mode</description>
         <addressOffset>0x0148</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P2.0 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P2.1 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P2.2 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P2.3 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P2.4 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P2.5 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P2.6 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P2.7 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- IN_MODE_P3: Port P3 GPIO Input Monitoring Mode -->
      <register>
         <name>IN_MODE_P3</name>
         <description>Port P3 GPIO Input Monitoring Mode</description>
         <addressOffset>0x014C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P3.0 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P3.1 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P3.2 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P3.3 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P3.4 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P3.5 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P3.6 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P3.7 Input Monitoring Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

