cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- IN_VAL_P5: Port P5 GPIO Input Value -->
      <register>
         <name>IN_VAL_P5</name>
         <description>Port P5 GPIO Input Value</description>
         <addressOffset>0x0194</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P5.0 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P5.1 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P5.2 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P5.3 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P5.4 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P5.5 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P5.6 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P5.7 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- IN_VAL_P6: Port P6 GPIO Input Value -->
      <register>
         <name>IN_VAL_P6</name>
         <description>Port P6 GPIO Input Value</description>
         <addressOffset>0x0198</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P6.0 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P6.1 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P6.2 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P6.3 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P6.4 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P6.5 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P6.6 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P6.7 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- IN_VAL_P7: Port P7 GPIO Input Value -->
      <register>
         <name>IN_VAL_P7</name>
         <description>Port P7 GPIO Input Value</description>
         <addressOffset>0x019C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P7.0 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P7.1 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P7.2 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P7.3 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P7.4 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P7.5 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P7.6 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P7.7 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- INT_MODE_P0: Port P0 Interrupt Detection Mode -->
      <register>
         <name>INT_MODE_P0</name>
         <description>Port P0 Interrupt Detection Mode</description>
         <addressOffset>0x01C0</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P0.0 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P0.1 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P0.2 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P0.3 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P0.4 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P0.5 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P0.6 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P0.7 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

