cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- INT_MODE_P1: Port P1 Interrupt Detection Mode -->
      <register>
         <name>INT_MODE_P1</name>
         <description>Port P1 Interrupt Detection Mode</description>
         <addressOffset>0x01C4</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P1.0 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P1.1 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P1.2 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P1.3 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P1.4 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P1.5 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P1.6 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P1.7 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INT_MODE_P2: Port P2 Interrupt Detection Mode -->
      <register>
         <name>INT_MODE_P2</name>
         <description>Port P2 Interrupt Detection Mode</description>
         <addressOffset>0x01C8</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P2.0 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P2.1 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P2.2 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P2.3 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P2.4 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P2.5 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P2.6 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P2.7 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INT_MODE_P3: Port P3 Interrupt Detection Mode -->
      <register>
         <name>INT_MODE_P3</name>
         <description>Port P3 Interrupt Detection Mode</description>
         <addressOffset>0x01CC</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pin0</name>
               <description>P3.0 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin1</name>
               <description>P3.1 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin2</name>
               <description>P3.2 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin3</name>
               <description>P3.3 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin4</name>
               <description>P3.4 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin5</name>
               <description>P3.5 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin6</name>
               <description>P3.6 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pin7</name>
               <description>P3.7 GPIO Interrupt Detection Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

