cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- PT:PTG -->

<peripheral>
   <name>PTG</name>
   <description>Pulse Train Generation</description>
   <groupName>PT</groupName>
   <baseAddress>0x40001000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0008</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL: Global Pulse Train Enable/Disable -->
      <register>
         <name>CTRL</name>
         <description>Global Pulse Train Enable/Disable</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>enable_all</name>
               <description>Enable/disable for all pulse trains</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- RESYNC: Global Resync (All Pulse Trains) Control -->
      <register>
         <name>RESYNC</name>
         <description>Global Resync (All Pulse Trains) Control</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pt0</name>
               <description>Resync control for PT0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt1</name>
               <description>Resync control for PT1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt2</name>
               <description>Resync control for PT2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt3</name>
               <description>Resync control for PT3</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt4</name>
               <description>Resync control for PT4</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt5</name>
               <description>Resync control for PT5</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt6</name>
               <description>Resync control for PT6</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt7</name>
               <description>Resync control for PT7</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt8</name>
               <description>Resync control for PT8</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt9</name>
               <description>Resync control for PT9</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt10</name>
               <description>Resync control for PT10</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt11</name>
               <description>Resync control for PT11</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt12</name>
               <description>Resync control for PT12</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt13</name>
               <description>Resync control for PT13</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt14</name>
               <description>Resync control for PT14</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pt15</name>
               <description>Resync control for PT15</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>write-only</access>
            </field>
         </fields>
      </register>

   </registers>
</peripheral>


<!-- PT:PT0 -->

<peripheral>
   <name>PT0</name>
   <description>Pulse Train Generation</description>
   <groupName>PT</groupName>
   <baseAddress>0x40001008</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0008</size>
      <usage>registers</usage>
   </addressBlock>

