cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <registers>

   <!-- RATE_LENGTH: Pulse Train Configuration -->
      <register>
         <name>RATE_LENGTH</name>
         <description>Pulse Train Configuration</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>rate_control</name>
               <description>Pulse Train Enable/Rate Control</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>mode</name>
               <description>Pulse Train Output Mode/Train Length</description>
               <enumeratedValues>
                  <enumeratedValue>
                     <name>32_BIT</name>
                     <description>Pulse train, 32 bit pattern.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>SQUARE_WAVE</name>
                     <description>Square wave mode.</description>
                     <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_BIT</name>
                     <description>Pulse train, 2 bit pattern.</description>
                     <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>3_BIT</name>
                     <description>Pulse train, 3 bit pattern.</description>
                     <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>4_BIT</name>
                     <description>Pulse train, 4 bit pattern.</description>
                     <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>5_BIT</name>
                     <description>Pulse train, 5 bit pattern.</description>
                     <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>6_BIT</name>
                     <description>Pulse train, 6 bit pattern.</description>
                     <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>7_BIT</name>
                     <description>Pulse train, 7 bit pattern.</description>
                     <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>8_BIT</name>
                     <description>Pulse train, 8 bit pattern.</description>
                     <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>9_BIT</name>
                     <description>Pulse train, 9 bit pattern.</description>
                     <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>10_BIT</name>
                     <description>Pulse train, 10 bit pattern.</description>
                     <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>11_BIT</name>
                     <description>Pulse train, 11 bit pattern.</description>
                     <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>12_BIT</name>
                     <description>Pulse train, 12 bit pattern.</description>
                     <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>13_BIT</name>
                     <description>Pulse train, 13 bit pattern.</description>
                     <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>14_BIT</name>
                     <description>Pulse train, 14 bit pattern.</description>
                     <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>15_BIT</name>
                     <description>Pulse train, 15 bit pattern.</description>
                     <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>16_BIT</name>
                     <description>Pulse train, 16 bit pattern.</description>
                     <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>17_BIT</name>
                     <description>Pulse train, 17 bit pattern.</description>
                     <value>23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>18_BIT</name>
                     <description>Pulse train, 18 bit pattern.</description>
                     <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>19_BIT</name>
                     <description>Pulse train, 19 bit pattern.</description>
                     <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>20_BIT</name>
                     <description>Pulse train, 20 bit pattern.</description>
                     <value>32</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>21_BIT</name>
                     <description>Pulse train, 21 bit pattern.</description>
                     <value>33</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>22_BIT</name>
                     <description>Pulse train, 22 bit pattern.</description>
                     <value>34</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>23_BIT</name>
                     <description>Pulse train, 23 bit pattern.</description>
                     <value>35</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>24_BIT</name>
                     <description>Pulse train, 24 bit pattern.</description>
                     <value>36</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>25_BIT</name>
                     <description>Pulse train, 25 bit pattern.</description>
                     <value>37</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>26_BIT</name>
                     <description>Pulse train, 26 bit pattern.</description>
                     <value>38</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>27_BIT</name>
                     <description>Pulse train, 27 bit pattern.</description>
                     <value>39</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>28_BIT</name>
                     <description>Pulse train, 28 bit pattern.</description>
                     <value>40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>29_BIT</name>
                     <description>Pulse train, 29 bit pattern.</description>
                     <value>41</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>30_BIT</name>
                     <description>Pulse train, 30 bit pattern.</description>
                     <value>48</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>31_BIT</name>
                     <description>Pulse train, 31 bit pattern.</description>
                     <value>49</value>
                  </enumeratedValue>
               </enumeratedValues>
               <bitRange>[31:27]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TRAIN: Pulse Train Output Pattern -->
      <register>
         <name>TRAIN</name>
         <description>Pulse Train Output Pattern</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
      </register>

