cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- PT:PT1 -->

<peripheral derivedFrom="PT0">
   <name>PT1</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001010</baseAddress>
</peripheral>


<!-- PT:PT2 -->

<peripheral derivedFrom="PT0">
   <name>PT2</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001018</baseAddress>
</peripheral>


<!-- PT:PT3 -->

<peripheral derivedFrom="PT0">
   <name>PT3</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001020</baseAddress>
</peripheral>


<!-- PT:PT4 -->

<peripheral derivedFrom="PT0">
   <name>PT4</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001028</baseAddress>
</peripheral>


<!-- PT:PT5 -->

<peripheral derivedFrom="PT0">
   <name>PT5</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001030</baseAddress>
</peripheral>


<!-- PT:PT6 -->

<peripheral derivedFrom="PT0">
   <name>PT6</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001038</baseAddress>
</peripheral>


<!-- PT:PT7 -->

<peripheral derivedFrom="PT0">
   <name>PT7</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001040</baseAddress>
</peripheral>


<!-- PT:PT8 -->

<peripheral derivedFrom="PT0">
   <name>PT8</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001048</baseAddress>
</peripheral>


<!-- PT:PT9 -->

<peripheral derivedFrom="PT0">
   <name>PT9</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001050</baseAddress>
</peripheral>


<!-- PT:PT10 -->

<peripheral derivedFrom="PT0">
   <name>PT10</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001058</baseAddress>
</peripheral>


<!-- PT:PT11 -->

<peripheral derivedFrom="PT0">
   <name>PT11</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001060</baseAddress>
</peripheral>


<!-- PT:PT12 -->

<peripheral derivedFrom="PT0">
   <name>PT12</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001068</baseAddress>
</peripheral>


<!-- PT:PT13 -->

<peripheral derivedFrom="PT0">
   <name>PT13</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001070</baseAddress>
</peripheral>


<!-- PT:PT14 -->

<peripheral derivedFrom="PT0">
   <name>PT14</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001078</baseAddress>
</peripheral>


<!-- PT:PT15 -->

<peripheral derivedFrom="PT0">
   <name>PT15</name>
   <groupName>PT</groupName>
   <baseAddress>0x40001080</baseAddress>
</peripheral>


<!-- CRC:CRC -->

<peripheral>
   <name>CRC</name>
   <description>CRC-16/CRC-32 Engine</description>
   <groupName>CRC</groupName>
   <baseAddress>0x40010000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- RESEED: CRC-16/CRC-32 Reseed Controls -->
      <register>
         <name>RESEED</name>
         <description>CRC-16/CRC-32 Reseed Controls</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>crc16</name>
               <description>Reseed CRC16 Generator</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>crc32</name>
               <description>Reseed CRC32 Generator</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- SEED16: Reseed Value for CRC-16 Calculations -->
      <register>
         <name>SEED16</name>
         <description>Reseed Value for CRC-16 Calculations</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
      </register>

   <!-- SEED32: Reseed Value for CRC-32 Calculations -->
      <register>
         <name>SEED32</name>
         <description>Reseed Value for CRC-32 Calculations</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
      </register>

   </registers>
</peripheral>


<!-- TPU:TPU -->

<peripheral>
   <name>TPU</name>
   <description>Trust Protection Unit (TPU)</description>
   <groupName>TPU</groupName>
   <baseAddress>0x40011000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0400</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- PRNG_USER_ENTROPY: PRNG User Entropy Value -->
      <register>
         <name>PRNG_USER_ENTROPY</name>
         <description>PRNG User Entropy Value</description>
         <addressOffset>0x0200</addressOffset>
         <access>read-write</access>
      </register>

   <!-- PRNG_RND_NUM: PRNG Random Number Output -->
      <register>
         <name>PRNG_RND_NUM</name>
         <description>PRNG Random Number Output</description>
         <addressOffset>0x0204</addressOffset>
         <access>read-write</access>
      </register>

   </registers>
</peripheral>


<!-- TPU:TPU_TSR -->

<peripheral>
   <name>TPU_TSR</name>
   <description>Trust Protection Unit (TPU)</description>
   <groupName>TPU</groupName>
   <baseAddress>0x40011C00</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0400</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- STATUS: Dynamic Tamper Sensor Status -->
      <register>
         <name>STATUS</name>
         <description>Dynamic Tamper Sensor Status</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
      </register>

   <!-- CTRL0: Dynamic Tamper Sensor Control 0 -->
      <register>
         <name>CTRL0</name>
         <description>Dynamic Tamper Sensor Control 0</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>err_thr</name>
               <description>Dynamic Sensor Error Threshold</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>out_freq</name>
               <description>Dynamic Sensor Output Frequency</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>clock_div</name>
               <description>Dynamic Sensor Clock Div</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rtc_tx_busy</name>
               <description>RTC Domain Tx Busy</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>lock</name>
               <description>Lock Bit</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CTRL1: Dynamic Tamper Sensor Control 1 -->
      <register>
         <name>CTRL1</name>
         <description>Dynamic Tamper Sensor Control 1</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
      </register>

   <!-- SKS0: TPU Secure Key Storage Register 0 (Cleared on Tamper Detect) -->
      <register>
         <name>SKS0</name>
         <description>TPU Secure Key Storage Register 0 (Cleared on Tamper Detect)</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
      </register>

   <!-- SKS1: TPU Secure Key Storage Register 1 (Cleared on Tamper Detect) -->
      <register>
         <name>SKS1</name>
         <description>TPU Secure Key Storage Register 1 (Cleared on Tamper Detect)</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
      </register>

   <!-- SKS2: TPU Secure Key Storage Register 2 (Cleared on Tamper Detect) -->
      <register>
         <name>SKS2</name>
         <description>TPU Secure Key Storage Register 2 (Cleared on Tamper Detect)</description>
         <addressOffset>0x0018</addressOffset>
         <access>read-write</access>
      </register>

   <!-- SKS3: TPU Secure Key Storage Register 3 (Cleared on Tamper Detect) -->
      <register>
         <name>SKS3</name>
         <description>TPU Secure Key Storage Register 3 (Cleared on Tamper Detect)</description>
         <addressOffset>0x001C</addressOffset>
         <access>read-write</access>
      </register>

