cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- AES:AES -->

<peripheral>
   <name>AES</name>
   <description>AES Cryptographic Engine</description>
   <groupName>AES</groupName>
   <baseAddress>0x40011400</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0400</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL: AES Control and Status -->
      <register>
         <name>CTRL</name>
         <description>AES Control and Status</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>start</name>
               <description>AES Start/Busy</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>crypt_mode</name>
               <description>AES Encrypt/Decrypt Mode</description>
               <enumeratedValues>
                  <enumeratedValue>
                     <name>#doxy_brief</name>
                     <description>Settings for AES_CTRL.crypt_mode</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>ENCRYPT_MODE</name>
                     <description>Perform AES encryption operation.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>DECRYPT_MODE</name>
                     <description>Perform AES decryption operation.</description>
                     <value>1</value>
                  </enumeratedValue>
               </enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>exp_key_mode</name>
               <description>AES Expanded Key Mode</description>
               <enumeratedValues>
                  <enumeratedValue>
                     <name>#doxy_brief</name>
                     <description>Settings for AES_CTRL.exp_key_mode</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>CALC_NEW_EXP_KEY</name>
                     <description>Calculate new expanded key for this operation.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>USE_LAST_EXP_KEY</name>
                     <description>Use expanded key calculated by the last operation.</description>
                     <value>1</value>
                  </enumeratedValue>
               </enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>key_size</name>
               <description>AES Key Size Select</description>
               <enumeratedValues>
                  <enumeratedValue>
                     <name>#doxy_brief</name>
                     <description>Settings for AES_CTRL.key_size</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>KEY_SIZE_128</name>
                     <description>Use 128-bit AES key size.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>KEY_SIZE_192</name>
                     <description>Use 192-bit AES key size.</description>
                     <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>KEY_SIZE_256</name>
                     <description>Use 256-bit AES key size.</description>
                     <value>2</value>
                  </enumeratedValue>
               </enumeratedValues>
               <bitRange>[4:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>inten</name>
               <description>AES Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>intfl</name>
               <description>AES Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- ERASE_ALL: Write to Trigger AES Memory Erase -->
      <register>
         <name>ERASE_ALL</name>
         <description>Write to Trigger AES Memory Erase</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
      </register>

   </registers>
</peripheral>


<!-- MAA:MAA -->

<peripheral>
   <name>MAA</name>
   <description>MAA Cryptographic Engine</description>
   <groupName>MAA</groupName>
   <baseAddress>0x40011800</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0400</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL: MAA Control, Configuration and Status -->
      <register>
         <name>CTRL</name>
         <description>MAA Control, Configuration and Status</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>start</name>
               <description>Start MAA Calculation</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>opsel</name>
               <description>Select Operation Type</description>
               <enumeratedValues>
                  <enumeratedValue>
                     <name>#doxy_brief</name>
                     <description>Operation select for MAA.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>EXP</name>
                     <description>Exponentiation.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>SQR</name>
                     <description>Square operation.</description>
                     <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>MUL</name>
                     <description>Multiply.</description>
                     <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>SQRMUL</name>
                     <description>Square operation followed by multiply.</description>
                     <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>ADD</name>
                     <description>Addition.</description>
                     <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>SUB</name>
                     <description>Subtraction.</description>
                     <value>5</value>
                  </enumeratedValue>
               </enumeratedValues>
               <bitRange>[3:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ocalc</name>
               <description>Optimized Calculation Control</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>if_done</name>
               <description>Interrupt Flag - Calculation Done</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>inten</name>
               <description>MAA Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>if_error</name>
               <description>Interrupt Flag - Error</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ofs_a</name>
               <description>Operand A Memory Offset Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ofs_b</name>
               <description>Operand B Memory Offset Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ofs_exp</name>
               <description>Exponent Memory Offset Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ofs_mod</name>
               <description>Modulus Memory Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>seg_a</name>
               <description>Operand A Memory Segment Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>seg_b</name>
               <description>Operand B Memory Segment Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>seg_res</name>
               <description>Result Memory Segment Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>seg_tmp</name>
               <description>Temporary Memory Segment Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- MAWS: MAA Word (Operand) Size, Big/Little Endian Mode Select -->
      <register>
         <name>MAWS</name>
         <description>MAA Word (Operand) Size, Big/Little Endian Mode Select</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>modlen</name>
               <description>MAA Word Size</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>byteswap</name>
               <description>Big Endian Byte Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

