cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- TMR:TMR0 -->

<peripheral>
   <name>TMR0</name>
   <description>16/32 bit Timer/Counters</description>
   <groupName>TMR</groupName>
   <baseAddress>0x40012000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL: Timer Control Register -->
      <register>
         <name>CTRL</name>
         <description>Timer Control Register</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mode</name>
               <description>Operating Modes for 32-bit/16-bit Timers</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tmr2x16</name>
               <description>Dual 16-bit Timer Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>prescale</name>
               <description>Timer Clock Prescale Setting</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>polarity</name>
               <description>Timer I/O Polarity</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>enable0</name>
               <description>Enable 32-bit timer / 16-bit timer 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>enable1</name>
               <description>Enable 16-bit timer 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- COUNT32: [32 bit] Current Count Value -->
      <register>
         <name>COUNT32</name>
         <description>[32 bit] Current Count Value</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
      </register>

   <!-- TERM_CNT32: [32 bit] Terminal Count Setting -->
      <register>
         <name>TERM_CNT32</name>
         <description>[32 bit] Terminal Count Setting</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
      </register>

   <!-- PWM_CAP32: [32 bit] PWM Compare Setting or Capture/Measure Value -->
      <register>
         <name>PWM_CAP32</name>
         <description>[32 bit] PWM Compare Setting or Capture/Measure Value</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
      </register>

   <!-- COUNT16_0: [16 bit] Current Count Value, 16-bit Timer 0 -->
      <register>
         <name>COUNT16_0</name>
         <description>[16 bit] Current Count Value, 16-bit Timer 0</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>value</name>
               <description>Count Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TERM_CNT16_0: [16 bit] Terminal Count Setting, 16-bit Timer 0 -->
      <register>
         <name>TERM_CNT16_0</name>
         <description>[16 bit] Terminal Count Setting, 16-bit Timer 0</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>term_count</name>
               <description>Terminal Count Setting</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- COUNT16_1: [16 bit] Current Count Value, 16-bit Timer 1 -->
      <register>
         <name>COUNT16_1</name>
         <description>[16 bit] Current Count Value, 16-bit Timer 1</description>
         <addressOffset>0x0018</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>value</name>
               <description>Count Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TERM_CNT16_1: [16 bit] Terminal Count Setting, 16-bit Timer 1 -->
      <register>
         <name>TERM_CNT16_1</name>
         <description>[16 bit] Terminal Count Setting, 16-bit Timer 1</description>
         <addressOffset>0x001C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>term_count</name>
               <description>Terminal Count Setting</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INTFL: Timer Module Interrupt Flags -->
      <register>
         <name>INTFL</name>
         <description>Timer Module Interrupt Flags</description>
         <addressOffset>0x0020</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>timer0</name>
               <description>Interrupt Flag for 32-bit Timer / 16-bit Timer 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>timer1</name>
               <description>Interrupt Flag for 16-bit Timer 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- INTEN: Timer Module Interrupt Enable/Disable Settings -->
      <register>
         <name>INTEN</name>
         <description>Timer Module Interrupt Enable/Disable Settings</description>
         <addressOffset>0x0024</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>timer0</name>
               <description>Interrupt Enable for 32-bit Timer / 16-bit Timer 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>timer1</name>
               <description>Interrupt Enable for 16-bit Timer 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

