cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- TMR:TMR1 -->

<peripheral derivedFrom="TMR0">
   <name>TMR1</name>
   <groupName>TMR</groupName>
   <baseAddress>0x40013000</baseAddress>
</peripheral>


<!-- TMR:TMR2 -->

<peripheral derivedFrom="TMR0">
   <name>TMR2</name>
   <groupName>TMR</groupName>
   <baseAddress>0x40014000</baseAddress>
</peripheral>


<!-- TMR:TMR3 -->

<peripheral derivedFrom="TMR0">
   <name>TMR3</name>
   <groupName>TMR</groupName>
   <baseAddress>0x40015000</baseAddress>
</peripheral>


<!-- WDT:WDT0 -->

<peripheral>
   <name>WDT0</name>
   <description>Watchdog Timers</description>
   <groupName>WDT</groupName>
   <baseAddress>0x40021000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL: WDT0 - Watchdog Timer Control Register -->
      <register>
         <name>CTRL</name>
         <description>WDT0 - Watchdog Timer Control Register</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>int_period</name>
               <description>Period from WDT Clear to Interrupt Flag Set</description>
               <enumeratedValues>
                  <enumeratedValue>
                     <name>#doxy_brief</name>
                     <description>Defines watchdog timer periods.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_31_CLKS</name>
                     <description>2^31 WDT clocks.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_30_CLKS</name>
                     <description>2^30 WDT clocks.</description>
                     <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_29_CLKS</name>
                     <description>2^29 WDT clocks.</description>
                     <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_28_CLKS</name>
                     <description>2^28 WDT clocks.</description>
                     <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_27_CLKS</name>
                     <description>2^27 WDT clocks.</description>
                     <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_26_CLKS</name>
                     <description>2^26 WDT clocks.</description>
                     <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_25_CLKS</name>
                     <description>2^25 WDT clocks.</description>
                     <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_24_CLKS</name>
                     <description>2^24 WDT clocks.</description>
                     <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_23_CLKS</name>
                     <description>2^23 WDT clocks.</description>
                     <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_22_CLKS</name>
                     <description>2^22 WDT clocks.</description>
                     <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_21_CLKS</name>
                     <description>2^21 WDT clocks.</description>
                     <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_20_CLKS</name>
                     <description>2^20 WDT clocks.</description>
                     <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_19_CLKS</name>
                     <description>2^19 WDT clocks.</description>
                     <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_18_CLKS</name>
                     <description>2^18 WDT clocks.</description>
                     <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_17_CLKS</name>
                     <description>2^17 WDT clocks.</description>
                     <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_16_CLKS</name>
                     <description>2^16 WDT clocks.</description>
                     <value>21</value>
                  </enumeratedValue>
               </enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rst_period</name>
               <description>Period from WDT Clear to Reset Flag Set</description>
               <enumeratedValues>
                  <enumeratedValue>
                     <name>#doxy_brief</name>
                     <description>Defines watchdog timer periods.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_31_CLKS</name>
                     <description>2^31 WDT clocks.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_30_CLKS</name>
                     <description>2^30 WDT clocks.</description>
                     <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_29_CLKS</name>
                     <description>2^29 WDT clocks.</description>
                     <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_28_CLKS</name>
                     <description>2^28 WDT clocks.</description>
                     <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_27_CLKS</name>
                     <description>2^27 WDT clocks.</description>
                     <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_26_CLKS</name>
                     <description>2^26 WDT clocks.</description>
                     <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_25_CLKS</name>
                     <description>2^25 WDT clocks.</description>
                     <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_24_CLKS</name>
                     <description>2^24 WDT clocks.</description>
                     <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_23_CLKS</name>
                     <description>2^23 WDT clocks.</description>
                     <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_22_CLKS</name>
                     <description>2^22 WDT clocks.</description>
                     <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_21_CLKS</name>
                     <description>2^21 WDT clocks.</description>
                     <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_20_CLKS</name>
                     <description>2^20 WDT clocks.</description>
                     <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_19_CLKS</name>
                     <description>2^19 WDT clocks.</description>
                     <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_18_CLKS</name>
                     <description>2^18 WDT clocks.</description>
                     <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_17_CLKS</name>
                     <description>2^17 WDT clocks.</description>
                     <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_16_CLKS</name>
                     <description>2^16 WDT clocks.</description>
                     <value>21</value>
                  </enumeratedValue>
               </enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_timer</name>
               <description>Watchdg Timer Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_clock</name>
               <description>Watchdog Clock Gate</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>wait_period</name>
               <description>Period from WDT Clear to Clear Window Begin</description>
               <enumeratedValues>
                  <enumeratedValue>
                     <name>#doxy_brief</name>
                     <description>Defines watchdog timer periods.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_31_CLKS</name>
                     <description>2^31 WDT clocks.</description>
                     <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_30_CLKS</name>
                     <description>2^30 WDT clocks.</description>
                     <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_29_CLKS</name>
                     <description>2^29 WDT clocks.</description>
                     <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_28_CLKS</name>
                     <description>2^28 WDT clocks.</description>
                     <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_27_CLKS</name>
                     <description>2^27 WDT clocks.</description>
                     <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_26_CLKS</name>
                     <description>2^26 WDT clocks.</description>
                     <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_25_CLKS</name>
                     <description>2^25 WDT clocks.</description>
                     <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_24_CLKS</name>
                     <description>2^24 WDT clocks.</description>
                     <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_23_CLKS</name>
                     <description>2^23 WDT clocks.</description>
                     <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_22_CLKS</name>
                     <description>2^22 WDT clocks.</description>
                     <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_21_CLKS</name>
                     <description>2^21 WDT clocks.</description>
                     <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_20_CLKS</name>
                     <description>2^20 WDT clocks.</description>
                     <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_19_CLKS</name>
                     <description>2^19 WDT clocks.</description>
                     <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_18_CLKS</name>
                     <description>2^18 WDT clocks.</description>
                     <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_17_CLKS</name>
                     <description>2^17 WDT clocks.</description>
                     <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                     <name>2_16_CLKS</name>
                     <description>2^16 WDT clocks.</description>
                     <value>21</value>
                  </enumeratedValue>
               </enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLEAR: WDT0 - Watchdog Clear Register (Feed Dog) -->
      <register>
         <name>CLEAR</name>
         <description>WDT0 - Watchdog Clear Register (Feed Dog)</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
      </register>

   <!-- FLAGS: WDT0 - Watchdog Interrupt and Reset Flags -->
      <register>
         <name>FLAGS</name>
         <description>WDT0 - Watchdog Interrupt and Reset Flags</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>timeout</name>
               <description>Watchdog Timeout Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pre_win</name>
               <description>Watchdog Pre-Window Clear Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>reset_out</name>
               <description>Watchdog Reset Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- ENABLE: WDT0 - Interrupt/Reset Enable/Disable Controls -->
      <register>
         <name>ENABLE</name>
         <description>WDT0 - Interrupt/Reset Enable/Disable Controls</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>timeout</name>
               <description>Enable Watchdog Interrupt</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pre_win</name>
               <description>Enable Watchdog Pre-Window Reset Interrupt</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>reset_out</name>
               <description>Enable Watchdog Reset Output</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- LOCK_CTRL: WDT0 - Register Setting Lock for WDT0_CTRL -->
      <register>
         <name>LOCK_CTRL</name>
         <description>WDT0 - Register Setting Lock for WDT0_CTRL</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>wdlock</name>
               <description>Lock for WDT CTRL Register</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

