cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- WDT:WDT1 -->

<peripheral derivedFrom="WDT0">
   <name>WDT1</name>
   <groupName>WDT</groupName>
   <baseAddress>0x40022000</baseAddress>
</peripheral>


<!-- SPI:SPI0 -->

<peripheral>
   <name>SPI0</name>
   <description>SPI Master Interface</description>
   <groupName>SPI</groupName>
   <baseAddress>0x40030000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- MSTR_CFG: SPI Master Configuration Register -->
      <register>
         <name>MSTR_CFG</name>
         <description>SPI Master Configuration Register</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>slave_sel</name>
               <description>SPI Slave Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>three_wire_mode</name>
               <description>3-Wire Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spi_mode</name>
               <description>SPI Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>page_size</name>
               <description>Page Size</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sck_hi_clk</name>
               <description>SCK High Clocks</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sck_lo_clk</name>
               <description>SCK Low Clocks</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>act_delay</name>
               <description>SS Active Timing</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>inact_delay</name>
               <description>SS Inactive Timing</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>alt_sck_hi_clk</name>
               <description>Alt SCK High Clocks</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>alt_sck_lo_clk</name>
               <description>Alt SCK Low Clocks</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- SS_SR_POLARITY: Polarity Control for SS and SR Signals -->
      <register>
         <name>SS_SR_POLARITY</name>
         <description>Polarity Control for SS and SR Signals</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>ss_polarity</name>
               <description>SS Signal Polarity</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fc_polarity</name>
               <description>SR Signal Polarity [FC Polarity]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- GEN_CTRL: SPI Master General Control Register -->
      <register>
         <name>GEN_CTRL</name>
         <description>SPI Master General Control Register</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>spi_mstr_en</name>
               <description>Enable/Disable SPI Master</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_fifo_en</name>
               <description>Transaction FIFO Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_en</name>
               <description>Results FIFO Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bit_bang_mode</name>
               <description>Bit Bang Mode Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bb_ss_in_out</name>
               <description>Bit Bang SS Input/Output</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bb_sr_in</name>
               <description>Bit Bang SR Input</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>bb_sck_in_out</name>
               <description>Bit Bang SCK Input/Output</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bb_sdio_in</name>
               <description>Bit Bang SDIO Input</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>bb_sdio_out</name>
               <description>Bit Bang SDIO Output</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bb_sdio_dr_en</name>
               <description>Bit Bang SDIO Drive Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- FIFO_CTRL: SPI Master FIFO Control Register -->
      <register>
         <name>FIFO_CTRL</name>
         <description>SPI Master FIFO Control Register</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_fifo_ae_lvl</name>
               <description>Transaction FIFO AE Level</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_fifo_used</name>
               <description>Transaction FIFO Used</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rx_fifo_af_lvl</name>
               <description>Results FIFO AF Level</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_used</name>
               <description>Results FIFO Used</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:24]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

