cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- SPCL_CTRL: SPI Master Special Mode Controls -->
      <register>
         <name>SPCL_CTRL</name>
         <description>SPI Master Special Mode Controls</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>ss_sample_mode</name>
               <description>SS Sample Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>miso_fc_en</name>
               <description>SDIO(1) to SR(0) Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss_sa_sdio_out</name>
               <description>SDIO Active Output Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss_sa_sdio_dr_en</name>
               <description>SDIO Active Drive Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INTFL: SPI Master Interrupt Flags -->
      <register>
         <name>INTFL</name>
         <description>SPI Master Interrupt Flags</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_stalled</name>
               <description>Transaction Stalled Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_stalled</name>
               <description>Results Stalled Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_ready</name>
               <description>Transaction Ready Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_done</name>
               <description>Results Done Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_fifo_ae</name>
               <description>TXFIFO Almost Empty Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_fifo_af</name>
               <description>RXFIFO Almost Full Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- INTEN: SPI Master Interrupt Enable/Disable Settings -->
      <register>
         <name>INTEN</name>
         <description>SPI Master Interrupt Enable/Disable Settings</description>
         <addressOffset>0x0018</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_stalled</name>
               <description>Transaction Stalled Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_stalled</name>
               <description>Results Stalled Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_ready</name>
               <description>Transaction Ready Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_done</name>
               <description>Results Done Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_fifo_ae</name>
               <description>TXFIFO Almost Empty Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_af</name>
               <description>RXFIFO Almost Full Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

