cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- SPI:SPI1 -->

<peripheral derivedFrom="SPI0">
   <name>SPI1</name>
   <groupName>SPI</groupName>
   <baseAddress>0x40031000</baseAddress>
</peripheral>


<!-- SPI:SPI2 -->

<peripheral derivedFrom="SPI0">
   <name>SPI2</name>
   <groupName>SPI</groupName>
   <baseAddress>0x40032000</baseAddress>
</peripheral>


<!-- UART:UART0 -->

<peripheral>
   <name>UART0</name>
   <description>UART / Serial Port Interface (Wasp-type)</description>
   <groupName>UART</groupName>
   <baseAddress>0x40038000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL: UART Control Register -->
      <register>
         <name>CTRL</name>
         <description>UART Control Register</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>rx_threshold</name>
               <description>Receive FIFO Interrupt Threshold</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>parity_enable</name>
               <description>Parity Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>parity_mode</name>
               <description>Parity Mode Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>parity_bias</name>
               <description>Parity Basis Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_fifo_flush</name>
               <description>Transmit FIFO Flush</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>rx_fifo_flush</name>
               <description>Receive FIFO Flush</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>char_length</name>
               <description>Character Transfer Bit Length</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>stop_bit_mode</name>
               <description>Stop Bit Mode Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hw_flow_ctrl_en</name>
               <description>Hardware Flow Control Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>baud_clk_en</name>
               <description>Baud Clock Generation Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- STATUS: UART Status Register -->
      <register>
         <name>STATUS</name>
         <description>UART Status Register</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_busy</name>
               <description>TX Busy</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rx_busy</name>
               <description>RX Busy</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rx_fifo_empty</name>
               <description>RX FIFO Empty</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rx_fifo_full</name>
               <description>RX FIFO Full</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>tx_fifo_empty</name>
               <description>TX FIFO Empty</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>tx_fifo_full</name>
               <description>TX FIFO Full</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rx_fifo_chars</name>
               <description>RX FIFO Chars Used</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>tx_fifo_chars</name>
               <description>TX FIFO Chars Used</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- INTEN: Interrupt Enable/Disable Controls -->
      <register>
         <name>INTEN</name>
         <description>Interrupt Enable/Disable Controls</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>rx_frame_error</name>
               <description>RX Frame Error Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_parity_error</name>
               <description>RX Parity Error Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>cts_change</name>
               <description>CTS Value Change Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_overrun</name>
               <description>RX Overrun Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_over_threshold</name>
               <description>RX FIFO Over Threshold Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_almost_empty</name>
               <description>TX FIFO Almost Empty Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_half_empty</name>
               <description>TX FIFO Half Empty Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INTFL: Interrupt Flags -->
      <register>
         <name>INTFL</name>
         <description>Interrupt Flags</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>rx_frame_error</name>
               <description>RX Frame Error Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_parity_error</name>
               <description>RX Parity Error Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
               <name>cts_change</name>
               <description>CTS Value Change Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_overrun</name>
               <description>RX Overrun Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_over_threshold</name>
               <description>RX FIFO Over Threshold Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_almost_empty</name>
               <description>TX FIFO Almost Empty Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_half_empty</name>
               <description>TX FIFO Half Empty Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

