cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- BAUD_INT: Baud Rate Setting (Integer Portion) -->
      <register>
         <name>BAUD_INT</name>
         <description>Baud Rate Setting (Integer Portion)</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>fbaud</name>
               <description>Integer portion of baudrate DIV.</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- BAUD_DIV_128: Baud Rate Setting (Div 128 Decimal Portion) -->
      <register>
         <name>BAUD_DIV_128</name>
         <description>Baud Rate Setting (Div 128 Decimal Portion)</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>div</name>
               <description>Decimal portion of baudrate DIV.</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TX_FIFO_OUT: TX FIFO Output End (read-only) -->
      <register>
         <name>TX_FIFO_OUT</name>
         <description>TX FIFO Output End (read-only)</description>
         <addressOffset>0x0018</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_fifo</name>
               <description>TX FIFO Output</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- HW_FLOW_CTRL: Hardware Flow Control Register -->
      <register>
         <name>HW_FLOW_CTRL</name>
         <description>Hardware Flow Control Register</description>
         <addressOffset>0x001C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>cts_input</name>
               <description>CTS Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rts_output</name>
               <description>RTS Output Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TX_RX_FIFO: [DR] Write to load TX FIFO, Read to unload RX FIFO -->
      <register>
         <name>TX_RX_FIFO</name>
         <description>[DR] Write to load TX FIFO, Read to unload RX FIFO</description>
         <addressOffset>0x0020</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>fifo_data</name>
               <description>TX/RX FIFO Data</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>parity_error</name>
               <description>Parity Error Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   </registers>
</peripheral>


<!-- UART:UART1 -->

<peripheral derivedFrom="UART0">
   <name>UART1</name>
   <groupName>UART</groupName>
   <baseAddress>0x40039000</baseAddress>
</peripheral>


<!-- I2C:I2CM0 -->

<peripheral>
   <name>I2CM0</name>
   <description>I2C Master Interface</description>
   <groupName>I2C</groupName>
   <baseAddress>0x40040000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- FS_CLK_DIV: Full Speed SCL Clock Settings -->
      <register>
         <name>FS_CLK_DIV</name>
         <description>Full Speed SCL Clock Settings</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>fs_filter_clk_div</name>
               <description>Full Speed Filter Clock Divisor</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fs_scl_lo_cnt</name>
               <description>Full Speed SCL Low Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fs_scl_hi_cnt</name>
               <description>Full Speed SCL High Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:20]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TIMEOUT: Timeout and Auto-Stop Settings -->
      <register>
         <name>TIMEOUT</name>
         <description>Timeout and Auto-Stop Settings</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_timeout</name>
               <description>Transaction Timeout Limit</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>auto_stop_en</name>
               <description>Auto-Stop Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

