cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- CTRL: I2C Master Control Register -->
      <register>
         <name>CTRL</name>
         <description>I2C Master Control Register</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_fifo_en</name>
               <description>Master Transaction FIFO Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_en</name>
               <description>Master Results FIFO Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>mstr_reset_en</name>
               <description>Master Reset</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TRANS: I2C Master Transaction Start and Status Flags -->
      <register>
         <name>TRANS</name>
         <description>I2C Master Transaction Start and Status Flags</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_start</name>
               <description>Start Transaction</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_in_progress</name>
               <description>Transaction In Progress</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>tx_done</name>
               <description>Transaction Done</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>tx_nacked</name>
               <description>Transaction Nacked</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>tx_lost_arbitr</name>
               <description>Transaction Lost Arbitration</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>tx_timeout</name>
               <description>Transaction Timed Out</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- INTFL: Interrupt Flags -->
      <register>
         <name>INTFL</name>
         <description>Interrupt Flags</description>
         <addressOffset>0x0018</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_done</name>
               <description>Transaction Done Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_nacked</name>
               <description>Transaction NACKed Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_lost_arbitr</name>
               <description>Transaction Lost Arbitration Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_timeout</name>
               <description>Transaction Timed Out Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_fifo_empty</name>
               <description>Transaction FIFO Empty Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_fifo_3q_empty</name>
               <description>Transaction FIFO 3Q Empty Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_fifo_empty</name>
               <description>Results FIFO Empty Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_fifo_2q_full</name>
               <description>Results FIFO 2Q Full Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_fifo_3q_full</name>
               <description>Results FIFO 3Q Full Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_fifo_full</name>
               <description>Results FIFO Full Int Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- INTEN: Interrupt Enable/Disable Controls -->
      <register>
         <name>INTEN</name>
         <description>Interrupt Enable/Disable Controls</description>
         <addressOffset>0x001C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tx_done</name>
               <description>Transaction Done Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_nacked</name>
               <description>Transaction NACKed Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_lost_arbitr</name>
               <description>Transaction Lost Arbitration IntEnable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_timeout</name>
               <description>Transaction Timed Out Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_fifo_empty</name>
               <description>Transaction FIFO Empty Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_fifo_3q_empty</name>
               <description>Transaction FIFO 3Q Empty Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_empty</name>
               <description>Results FIFO Empty Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_2q_full</name>
               <description>Results FIFO 2Q Full Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_3q_full</name>
               <description>Results FIFO 3Q Full Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_full</name>
               <description>Results FIFO Full Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- BB: Bit-Bang Control Register -->
      <register>
         <name>BB</name>
         <description>Bit-Bang Control Register</description>
         <addressOffset>0x0028</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>bb_scl_out</name>
               <description>Bit Bang SCL Output</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bb_sda_out</name>
               <description>Bit Bang SDA Output</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bb_scl_in_val</name>
               <description>Bit Bang SCL Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>bb_sda_in_val</name>
               <description>Bit Bang SCL Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rx_fifo_cnt</name>
               <description>Results FIFO Data Received Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:16]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

