cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- I2C:I2CM1 -->

<peripheral derivedFrom="I2CM0">
   <name>I2CM1</name>
   <groupName>I2C</groupName>
   <baseAddress>0x40042000</baseAddress>
</peripheral>


<!-- I2C:I2CS0 -->

<peripheral>
   <name>I2CS0</name>
   <description>I2C Slave Interface</description>
   <groupName>I2C</groupName>
   <baseAddress>0x40041000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- FS_CLK_DIV: Full Speed SCL Clock Settings -->
      <register>
         <name>FS_CLK_DIV</name>
         <description>Full Speed SCL Clock Settings</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>fs_filter_clk_div</name>
               <description>Full Speed Filter Clock Divisor</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fs_scl_lo_cnt</name>
               <description>Full Speed SCL Low Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fs_scl_hi_cnt</name>
               <description>Full Speed SCL High Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:20]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- DEV_IDS: Slave Device ID Settings -->
      <register>
         <name>DEV_IDS</name>
         <description>Slave Device ID Settings</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>dev_id0</name>
               <description>Slave Device ID 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dev_id1</name>
               <description>Slave Device ID 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dev_10b</name>
               <description>10-bit Device ID Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TIMEOUT: Timeout and Auto-Stop Settings -->
      <register>
         <name>TIMEOUT</name>
         <description>Timeout and Auto-Stop Settings</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>clk_stretch_to_limit</name>
               <description>Clock-Stretch Timeout Limit</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>max_rx_block_size</name>
               <description>Max RX Block Size</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>max_rx_block_size_en</name>
               <description>Enforce Max RX Block Size</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_arbitr_en</name>
               <description>Enable Slave TX Arbitration</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_stop_record_en</name>
               <description>Push RX Stop Record</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:27]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CTRL: I2C Slave Interface Control Register -->
      <register>
         <name>CTRL</name>
         <description>I2C Slave Interface Control Register</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>rx_fifo_en</name>
               <description>Slave RX FIFO Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_fifo_en</name>
               <description>Slave TX FIFO Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_en</name>
               <description>Slave RX Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_en</name>
               <description>Slave TX Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>slave_reset_en</name>
               <description>Slave I2C Reset</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INTFL: Interrupt Flags -->
      <register>
         <name>INTFL</name>
         <description>Interrupt Flags</description>
         <addressOffset>0x0020</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>clk_stretch_to</name>
               <description>Clock Stretch Timeout Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_fifo_empty</name>
               <description>Tx FIFO Empty Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_fifo_3q_empty</name>
               <description>Tx FIFO 3Q Empty Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_fifo_empty</name>
               <description>Rx FIFO Empty Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_fifo_2q_full</name>
               <description>Rx FIFO 2Q Full Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_fifo_3q_full</name>
               <description>Rx FIFO 3Q Full Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_fifo_full</name>
               <description>Rx FIFO Full Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rx_clk_stretch</name>
               <description>Rx Clock Stretch Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_clk_stretch_id0</name>
               <description>Tx Clock Stretch (ID0) Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>tx_clk_stretch_id1</name>
               <description>Tx Clock Stretch (ID1) Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>restart_id0</name>
               <description>Restart Detected (ID0) Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>restart_id1</name>
               <description>Restart Detected (ID1) Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>stop_id0</name>
               <description>Stop Detected (ID0) Interrupt  Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>stop_id1</name>
               <description>Stop Detected (ID1) Interrupt  Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lost_arbitr_id0</name>
               <description>Lost Arbitration (ID0) Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lost_arbitr_id1</name>
               <description>Lost Arbitration (ID1) Interrupt Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- INTEN: Interrupt Enable/Disable Controls -->
      <register>
         <name>INTEN</name>
         <description>Interrupt Enable/Disable Controls</description>
         <addressOffset>0x0024</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>clk_stretch_to</name>
               <description>Clock Stretch Timeout Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_fifo_empty</name>
               <description>Tx FIFO Empty Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_fifo_3q_empty</name>
               <description>Tx FIFO 3Q Empty Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_empty</name>
               <description>Rx FIFO Empty Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_2q_full</name>
               <description>Rx FIFO 2Q Full Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_3q_full</name>
               <description>Rx FIFO 3Q Full Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_fifo_full</name>
               <description>Rx FIFO Full Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rx_clk_stretch</name>
               <description>Rx Clock Stretch Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_clk_stretch_id0</name>
               <description>Tx Clock Stretch (ID0) Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tx_clk_stretch_id1</name>
               <description>Tx Clock Stretch (ID1) Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>restart_id0</name>
               <description>Restart Detected (ID0) Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>restart_id1</name>
               <description>Restart Detected (ID1) Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>stop_id0</name>
               <description>Stop Detected (ID0) Interrupt  Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>stop_id1</name>
               <description>Stop Detected (ID1) Interrupt  Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lost_arbitr_id0</name>
               <description>Lost Arbitration (ID0) Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lost_arbitr_id1</name>
               <description>Lost Arbitration (ID1) Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- BB: Bit-Bang Control Register -->
      <register>
         <name>BB</name>
         <description>Bit-Bang Control Register</description>
         <addressOffset>0x0028</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>scl_out</name>
               <description>Bit Bang SCL Output</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sda_out</name>
               <description>Bit Bang SDA Output</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>scl_in_val</name>
               <description>Bit Bang SCL Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>sda_in_val</name>
               <description>Bit Bang SDA Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rx_fifo_word_count</name>
               <description>RX FIFO Word Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:16]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- SRX_PEEK: RX FIFO Peek (Read from end without pull operation) -->
      <register>
         <name>SRX_PEEK</name>
         <description>RX FIFO Peek (Read from end without pull operation)</description>
         <addressOffset>0x002C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>rx_data</name>
               <description>Slave RX Data Nondestructive</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rx_fifo_read_only</name>
               <description>Slave RX FIFO Empty</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

