cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- DAC:DAC0 -->

<peripheral>
   <name>DAC0</name>
   <description>DAC (DAC0-12bit, DAC1-12bit, DAC2-8bit, DAC3-8bit)</description>
   <groupName>DAC</groupName>
   <baseAddress>0x40050000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL0: DAC Control Register 0 -->
      <register>
         <name>CTRL0</name>
         <description>DAC Control Register 0</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>fifo_ae_cnt</name>
               <description>DAC FIFO Almost Empty Threshold</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fifo_almost_full</name>
               <description>DAC FIFO Almost Full Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>fifo_empty</name>
               <description>DAC FIFO Empty Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>fifo_almost_empty</name>
               <description>DAC FIFO Almost Empty Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>interp_mode</name>
               <description>DAC Output Interpolation Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fifo_af_cnt</name>
               <description>DAC FIFO Almost Full Threshold</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>start_mode</name>
               <description>DAC Output Start Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>cpu_start</name>
               <description>DAC Output CPU Start</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_mode</name>
               <description>DAC Operation Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>power_mode_1_0</name>
               <description>DAC Power Mode (bits 1 and 0)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>power_on</name>
               <description>DAC Power On Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>clock_gate_en</name>
               <description>DAC Interface Clock Gate Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:29]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>power_mode_2</name>
               <description>DAC Power Mode (bit 2)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:30]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>reset</name>
               <description>DAC Reset</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:31]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- RATE: DAC Output Rate/Sample Control -->
      <register>
         <name>RATE</name>
         <description>DAC Output Rate/Sample Control</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>rate_cnt</name>
               <description>DAC Output Rate Control</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sample_cnt</name>
               <description>DAC Output Sample Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:16]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CTRL1_INT: DAC Control Register 1, Interrupt Flags and Enable/Disable -->
      <register>
         <name>CTRL1_INT</name>
         <description>DAC Control Register 1, Interrupt Flags and Enable/Disable</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>out_done_if</name>
               <description>DAC Output Done Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>underflow_if</name>
               <description>FIFO Underflow Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>almost_empty_if</name>
               <description>FIFO Almost Empty Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>underflow</name>
               <description>FIFO Underflow Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>out_done_ie</name>
               <description>DAC Output Done Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>underflow_ie</name>
               <description>FIFO Underflow Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>almost_empty_ie</name>
               <description>FIFO Almost Empty Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ahb_cg_disable</name>
               <description>Local AHB dynamic clock gate disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>apb_cg_disable</name>
               <description>Local APB dynamic clock gate disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:29]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

