cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- DAC:DAC1 -->

<peripheral derivedFrom="DAC0">
   <name>DAC1</name>
   <groupName>DAC</groupName>
   <baseAddress>0x40051000</baseAddress>
</peripheral>


<!-- DAC:DAC2 -->

<peripheral derivedFrom="DAC0">
   <name>DAC2</name>
   <groupName>DAC</groupName>
   <baseAddress>0x40052000</baseAddress>
</peripheral>


<!-- DAC:DAC3 -->

<peripheral derivedFrom="DAC0">
   <name>DAC3</name>
   <groupName>DAC</groupName>
   <baseAddress>0x40053000</baseAddress>
</peripheral>


<!-- AFE:AFE -->

<peripheral>
   <name>AFE</name>
   <description>Analog Front End Controls</description>
   <groupName>AFE</groupName>
   <baseAddress>0x4005401C</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x001C</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- INTR: Analog Front End Interrupt Flags and Enable/Disable -->
      <register>
         <name>INTR</name>
         <description>Analog Front End Interrupt Flags and Enable/Disable</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>op_comp_a_int</name>
               <description>Op Amp A Comparator Event Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>op_comp_b_int</name>
               <description>Op Amp B Comparator Event Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>op_comp_c_int</name>
               <description>Op Amp C Comparator Event Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>op_comp_d_int</name>
               <description>Op Amp D Comparator Event Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lp_comp_a_int</name>
               <description>Low-Power Comparator A Event Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lp_comp_b_int</name>
               <description>Low-Power Comparator B Event Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lp_comp_c_int</name>
               <description>Low-Power Comparator C Event Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lp_comp_d_int</name>
               <description>Low-Power Comparator D Event Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>op_comp_a_nma</name>
               <description>Op Amp Comparator A Non-Maskable Event Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>op_comp_b_nma</name>
               <description>Op Amp Comparator B Non-Maskable Event Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>op_comp_c_nma</name>
               <description>Op Amp Comparator C Non-Maskable Event Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>op_comp_d_nma</name>
               <description>Op Amp Comparator D Non-Maskable Event Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lp_comp_a_nma</name>
               <description>Low-Power Comparator A Non-Maskable Event Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lp_comp_b_nma</name>
               <description>Low-Power Comparator B Non-Maskable Event Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lp_comp_c_nma</name>
               <description>Low-Power Comparator C Non-Maskable Event Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lp_comp_d_nma</name>
               <description>Low-Power Comparator D Non-Maskable Event Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>op_comp_a_pol</name>
               <description>Op Amp Comparator A Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_comp_b_pol</name>
               <description>Op Amp Comparator B Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_comp_c_pol</name>
               <description>Op Amp Comparator C Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_comp_d_pol</name>
               <description>Op Amp Comparator D Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lp_comp_a_pol</name>
               <description>Low-Power Comparator A Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lp_comp_b_pol</name>
               <description>Low-Power Comparator B Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:21]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lp_comp_c_pol</name>
               <description>Low-Power Comparator C Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lp_comp_d_pol</name>
               <description>Low-Power Comparator D Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:23]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_comp_a_en</name>
               <description>Op Amp Comparator A Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_comp_b_en</name>
               <description>Op Amp Comparator B Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_comp_c_en</name>
               <description>Op Amp Comparator C Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_comp_d_en</name>
               <description>Op Amp Comparator D Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:27]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lp_comp_a_en</name>
               <description>Low-Power Comparator A Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lp_comp_b_en</name>
               <description>Low-Power Comparator B Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:29]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lp_comp_c_en</name>
               <description>Low-Power Comparator C Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:30]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lp_comp_d_en</name>
               <description>Low-Power Comparator D Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:31]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CTRL0: Analog Front End Control 0 -->
      <register>
         <name>CTRL0</name>
         <description>Analog Front End Control 0</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>led_cfg_port0</name>
               <description>LED Port 0 Drive Configuration</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>led_cfg_port1</name>
               <description>LED Port 1 Drive Configuration</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>clear_wud_comp_a</name>
               <description>Clear Wakeup Detect for Low-Power Comparator A</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>clear_wud_comp_b</name>
               <description>Clear Wakeup Detect for Low-Power Comparator B</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>clear_wud_comp_c</name>
               <description>Clear Wakeup Detect for Low-Power Comparator C</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>clear_wud_comp_d</name>
               <description>Clear Wakeup Detect for Low-Power Comparator D</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_wud_comp_a</name>
               <description>Set Wakeup Detect for Low-Power Comparator A</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_wud_comp_b</name>
               <description>Set Wakeup Detect for Low-Power Comparator B</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_wud_comp_c</name>
               <description>Set Wakeup Detect for Low-Power Comparator C</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_wud_comp_d</name>
               <description>Set Wakeup Detect for Low-Power Comparator D</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>in_mode_comp_a</name>
               <description>Low-Power Comparator A Input Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>in_mode_comp_b</name>
               <description>Low-Power Comparator A Input Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>in_mode_comp_c</name>
               <description>Low-Power Comparator C Input Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>in_mode_comp_d</name>
               <description>Low-Power Comparator D Input Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bias_mode_comp_a</name>
               <description>Low-Power Comparator A Bias Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bias_mode_comp_b</name>
               <description>Low-Power Comparator B Bias Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bias_mode_comp_c</name>
               <description>Low-Power Comparator C Bias Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bias_mode_comp_d</name>
               <description>Low-Power Comparator D Bias Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:30]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CTRL1: Analog Front End Control 1 -->
      <register>
         <name>CTRL1</name>
         <description>Analog Front End Control 1</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>tmon_current_en</name>
               <description>Temperature Sense Current Source Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tmon_current_val</name>
               <description>Temperature Sense Current Source Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>refadc_fast_pwrdn_en</name>
               <description>ADC Reference Fast Powerdown Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>refdac_fast_pwrdn_en</name>
               <description>DAC Reference Fast Powerdown Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bgextsel</name>
               <description>ADC/DAC Reference Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adcrefsel</name>
               <description>ADC Reference Voltage Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dacrefsel</name>
               <description>DAC Reference Voltage Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dacsel</name>
               <description>DAC Reference Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>refadc_outen</name>
               <description>Internal ADC Reference Output Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>refdac_outen</name>
               <description>DAC Reference Powerup</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ref_pu</name>
               <description>Reference Block Powerup</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>refadc_cp</name>
               <description>ADC Reference Compensation Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>refdac_cp</name>
               <description>DAC Reference Compensation Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>v1extadj</name>
               <description>v1extadj</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:25]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tmon_ext_sel</name>
               <description>Temperature Sense Current Source Routing Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:30]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

