cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- CTRL2: Analog Front End Control 2 -->
      <register>
         <name>CTRL2</name>
         <description>Analog Front End Control 2</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>hyst_comp_a</name>
               <description>Low-Power Comparator A Hysteresis Magnitude Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hyst_comp_b</name>
               <description>Low-Power Comparator B Hysteresis Magnitude Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hyst_comp_c</name>
               <description>Low-Power Comparator C Hysteresis Magnitude Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hyst_comp_d</name>
               <description>Low-Power Comparator D Hysteresis Magnitude Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hy_pol_comp_a</name>
               <description>Low-Power Comparator A Hysteresis Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hy_pol_comp_b</name>
               <description>Low-Power Comparator B Hysteresis Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hy_pol_comp_c</name>
               <description>Low-Power Comparator C Hysteresis Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hy_pol_comp_d</name>
               <description>Low-Power Comparator D Hysteresis Polarity Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>poweru_comp_a</name>
               <description>Low-Power Comparator A Powerup/Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>poweru_comp_b</name>
               <description>Low-Power Comparator B Powerup/Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>poweru_comp_c</name>
               <description>Low-Power Comparator C Powerup/Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>poweru_comp_d</name>
               <description>Low-Power Comparator D Powerup/Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dacout_en0</name>
               <description>Connects DAC_orx output selected by DAC_selx to SNOx</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dacout_en1</name>
               <description>Connects DAC_orx output selected by DAC_selx to SNOx</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dacout_en2</name>
               <description>Connects DAC_orx output selected by DAC_selx to SNOx</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dacout_en3</name>
               <description>Connects DAC_orx output selected by DAC_selx to SNOx</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>scm_or_sel</name>
               <description>Selects source for SCM_or signal</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sno_or_sel</name>
               <description>Selects source for SNO_or signal</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:23]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac0_sel</name>
               <description>Internal input stage select for dac0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac1_sel</name>
               <description>Internal input stage select for dac1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:27]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CTRL3: Analog Front End Control 3 -->
      <register>
         <name>CTRL3</name>
         <description>Analog Front End Control 3</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pu_opamp_a</name>
               <description>Op Amp A Power Up</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pu_opamp_b</name>
               <description>Op Amp B Power Up</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pu_opamp_c</name>
               <description>Op Amp C Power Up</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pu_opamp_d</name>
               <description>Op Amp D Power Up</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>gnd_sel_opamp_a</name>
               <description>Op Amp A Positive Input Ground Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>gnd_sel_opamp_b</name>
               <description>Op Amp B Positive Input Ground Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>gnd_sel_opamp_c</name>
               <description>Op Amp C Positive Input Ground Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>gnd_sel_opamp_d</name>
               <description>Op Amp D Positive Input Ground Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>close_spst0</name>
               <description>Switch Close for SPST0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>close_spst1</name>
               <description>Switch Close for SPST1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:21]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>close_spst2</name>
               <description>Switch Close for SPST2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>close_spst3</name>
               <description>Switch Close for SPST3</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:23]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_pch_opamp_a</name>
               <description>Op Amp A P-Channel Input Stage Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_pch_opamp_b</name>
               <description>Op Amp B P-Channel Input Stage Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_pch_opamp_c</name>
               <description>Op Amp C P-Channel Input Stage Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_pch_opamp_d</name>
               <description>Op Amp D P-Channel Input Stage Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:27]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_nch_opamp_a</name>
               <description>Op Amp A N-Channel Input Stage Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_nch_opamp_b</name>
               <description>Op Amp B N-Channel Input Stage Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:29]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_nch_opamp_c</name>
               <description>Op Amp C N-Channel Input Stage Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:30]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_nch_opamp_d</name>
               <description>Op Amp D N-Channel Input Stage Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:31]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CTRL4: Analog Front End Control 4 -->
      <register>
         <name>CTRL4</name>
         <description>Analog Front End Control 4</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>p_in_sel_opamp_a</name>
               <description>Op Amp A Positive Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>p_in_sel_opamp_b</name>
               <description>Op Amp B Positive Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>p_in_sel_opamp_c</name>
               <description>Op Amp C Positive Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>p_in_sel_opamp_d</name>
               <description>Op Amp D Positive Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>n_in_sel_opamp_a</name>
               <description>Op Amp A Negative Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>n_in_sel_opamp_b</name>
               <description>Op Amp B Negative Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>n_in_sel_opamp_c</name>
               <description>Op Amp C Negative Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>n_in_sel_opamp_d</name>
               <description>Op Amp D Negative Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac_sel_a</name>
               <description>DAC Output Mux Select to dac_or0 Stage</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac_sel_b</name>
               <description>DAC Output Mux Select to dac_or1 Stage</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac_sel_c</name>
               <description>DAC Output Mux Select to dac_or2 Stage</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac_sel_d</name>
               <description>DAC Output Mux Select to dac_or3 Stage</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>npad_sel_a</name>
               <description>Pad Internal Connect to INA-</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>npad_sel_b</name>
               <description>Pad Internal Connect to INB-</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>npad_sel_c</name>
               <description>Pad Internal Connect to INC-</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>npad_sel_d</name>
               <description>Pad Internal Connect to IND-</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:30]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CTRL5: Analog Front End Control 5 -->
      <register>
         <name>CTRL5</name>
         <description>Analog Front End Control 5</description>
         <addressOffset>0x0018</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pos_in_sel_comp_a</name>
               <description>Low-Power Comparator A Positive Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pos_in_sel_comp_b</name>
               <description>Low-Power Comparator B Positive Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pos_in_sel_comp_c</name>
               <description>Low-Power Comparator C Positive Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pos_in_sel_comp_d</name>
               <description>Low-Power Comparator D Positive Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>neg_in_sel_comp_a</name>
               <description>Low-Power Comparator A Negative Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>neg_in_sel_comp_b</name>
               <description>Low-Power Comparator B Negative Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>neg_in_sel_comp_c</name>
               <description>Low-Power Comparator C Negative Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>neg_in_sel_comp_d</name>
               <description>Low-Power Comparator D Negative Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:21]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_cmp_a</name>
               <description>Mode Select for Op Amp A</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_cmp_b</name>
               <description>Mode Select for Op Amp B</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_cmp_c</name>
               <description>Mode Select for Op Amp C</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>op_cmp_d</name>
               <description>Mode Select for Op Amp D</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:27]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

