cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- AFE:ADC -->

<peripheral>
   <name>ADC</name>
   <description>ADC</description>
   <groupName>AFE</groupName>
   <baseAddress>0x40054000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x001C</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL0: ADC Control Register 0 -->
      <register>
         <name>CTRL0</name>
         <description>ADC Control Register 0</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>adc_strt_mode</name>
               <description>ADC Start Mode Control</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>range</name>
               <description>ADC Range Control (Bipolar Mode Only)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bi_pol</name>
               <description>ADC Unipolar/Bipolar Mode Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_clk_en</name>
               <description>ADC Interface Clock Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>cpu_adc_rst</name>
               <description>CPU ADC Reset</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>cpu_adc_strt</name>
               <description>CPU Start for ADC Data Collection</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_en</name>
               <description>CPU ADC Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_fifo_full</name>
               <description>ADC FIFO Almost Full Warning</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>adc_fifo_empty</name>
               <description>ADC FIFO Empty Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>avg_mode</name>
               <description>ADC Decimation Filter Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>cpu_dac_strt</name>
               <description>CPU DAC Sequence Start</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_clk_mode</name>
               <description>ADC Clock Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>mode</name>
               <description>ADC Operating Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- PGA_CTRL: PGA Control Register -->
      <register>
         <name>PGA_CTRL</name>
         <description>PGA Control Register</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>gain</name>
               <description>PGA Gain Setting</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>cpu_pga_bypass</name>
               <description>PGA Bypass Control</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pga_wake_cnt</name>
               <description>PGA Wakeup Counter</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>mux_diff</name>
               <description>Differential ADC Mux Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>mux_ch_sel</name>
               <description>ADC Input Mux Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TG_CTRL0: ADC Timing Generator Control 0 -->
      <register>
         <name>TG_CTRL0</name>
         <description>ADC Timing Generator Control 0</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pga_trk_cnt</name>
               <description>PGA Track Window Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_smpl_cnt</name>
               <description>ADC Sample Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:16]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TG_CTRL1: ADC Timing Generator Control 1 -->
      <register>
         <name>TG_CTRL1</name>
         <description>ADC Timing Generator Control 1</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pga_acq_cnt</name>
               <description>PGA Acquisition Window Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fifo_af_cnt</name>
               <description>ADC FIFO Almost Full Threshold Control</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_brst_cnt</name>
               <description>ADC Burst Count Setting</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_acq_cnt</name>
               <description>ADC Acquisition Window Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_sleep_cnt</name>
               <description>ADC Sleep Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:16]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- LIMIT: ADC Limit Settings -->
      <register>
         <name>LIMIT</name>
         <description>ADC Limit Settings</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>lo_limit</name>
               <description>ADC Sample Lower Limit</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hi_limit</name>
               <description>ADC Sample Upper Limit</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:16]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INTR: ADC Interrupt Flags and Enable/Disable Controls -->
      <register>
         <name>INTR</name>
         <description>ADC Interrupt Flags and Enable/Disable Controls</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>fifo_af</name>
               <description>ADC FIFO Almost Full Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>out_rng</name>
               <description>ADC Sample Out of Range Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>hi_rng</name>
               <description>ADC Sample Above High Limit Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>lo_rng</name>
               <description>ADC Sample Below Low Limit Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>done</name>
               <description>ADC Data Collection Complete Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>fifo_uf</name>
               <description>ADC FIFO Underflow Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>fifo_of</name>
               <description>ADC FIFO Overflow Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>fifo_tf</name>
               <description>ADC FIFO Three-Quarters Full Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>fifo_hf</name>
               <description>ADC FIFO Half Full Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>fifo_qf</name>
               <description>ADC FIFO One-Quarter Full Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>spst_sw0_ctrl</name>
               <description>SPST0 Switch Control Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spst_sw1_ctrl</name>
               <description>SPST1 Switch Control Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spst_sw2_ctrl</name>
               <description>SPST2 Switch Control Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spst_sw3_ctrl</name>
               <description>SPST3 Switch Control Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fifo_af_en</name>
               <description>ADC FIFO Almost Full Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>out_rng_en</name>
               <description>ADC Sample Out of Range Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:23]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hi_rng_en</name>
               <description>ADC Sample Above High Limit Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lo_rng_en</name>
               <description>ADC Sample Below Low Limit Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>done_en</name>
               <description>ADC Data Collection Complete Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fifo_uf_en</name>
               <description>ADC FIFO Underflow Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:27]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fifo_of_en</name>
               <description>ADC FIFO Overflow Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fifo_tf_en</name>
               <description>ADC FIFO Three-Quarters Full Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:29]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fifo_hf_en</name>
               <description>ADC FIFO Half Full Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:30]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fifo_qf_en</name>
               <description>ADC FIFO One-Quarter Full Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:31]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

