cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- OUT: ADC Output Register -->
      <register>
         <name>OUT</name>
         <description>ADC Output Register</description>
         <addressOffset>0x0018</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>data_reg</name>
               <description>ADC Current Valid Data Sample</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   </registers>
</peripheral>


<!-- AFE:ADCCFG -->

<peripheral>
   <name>ADCCFG</name>
   <description>ADC</description>
   <groupName>AFE</groupName>
   <baseAddress>0x40054038</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0100</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL1: ADC Control Register 1 -->
      <register>
         <name>CTRL1</name>
         <description>ADC Control Register 1</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>scan_cnt</name>
               <description>Channel Scan Count</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:16]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- SCAN1: ADC Auto-Scan Settings 1 -->
      <register>
         <name>SCAN1</name>
         <description>ADC Auto-Scan Settings 1</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>adc_scan0</name>
               <description>ADC Scan Configuration - Channel 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_scan1</name>
               <description>ADC Scan Configuration - Channel 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_scan2</name>
               <description>ADC Scan Configuration - Channel 2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_scan3</name>
               <description>ADC Scan Configuration - Channel 3</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- SCAN2: ADC Auto-Scan Settings 2 -->
      <register>
         <name>SCAN2</name>
         <description>ADC Auto-Scan Settings 2</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>adc_scan4</name>
               <description>ADC Scan Configuration - Channel 4</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_scan5</name>
               <description>ADC Scan Configuration - Channel 5</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_scan6</name>
               <description>ADC Scan Configuration - Channel 6</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_scan7</name>
               <description>ADC Scan Configuration - Channel 7</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- RO_CAL0: ADC Relaxation Oscillator Calibration 0 -->
      <register>
         <name>RO_CAL0</name>
         <description>ADC Relaxation Oscillator Calibration 0</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>ro_cal_en</name>
               <description>Relaxation Oscillator Auto-Calibration Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ro_cal_run</name>
               <description>Enable Closed Loop Control</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ro_cal_load</name>
               <description>Load Initial RO Calibration Trim</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>trm_mu</name>
               <description>Auto Calibration Loop Gain</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ro_trm</name>
               <description>Auto Calibration Loop Register Readback</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:23]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

