cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- RO_CAL1: ADC Relaxation Oscillator Calibration 1 -->
      <register>
         <name>RO_CAL1</name>
         <description>ADC Relaxation Oscillator Calibration 1</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>trm_init</name>
               <description>Initial Setting for RO Trim Calibration</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>trm_min</name>
               <description>Trim Lower Limit</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>trm_max</name>
               <description>Trim Upper Limit</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:20]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   </registers>
</peripheral>


<!-- PMU:PMU0 -->

<peripheral>
   <name>PMU0</name>
   <description>Peripheral Management Unit</description>
   <groupName>PMU</groupName>
   <baseAddress>0x40070000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x20</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- DSCADR: Starting Descriptor Address -->
      <register>
         <name>DSCADR</name>
         <description>Starting Descriptor Address</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
      </register>

   <!-- CFG: Channel Configuration -->
      <register>
         <name>CFG</name>
         <description>Channel Configuration</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>enable</name>
               <description>PMU Channel Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ll_stopped</name>
               <description>Linked List Engine Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>manual</name>
               <description>Manual Mode Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>bus_error</name>
               <description>AHB Bus Error Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>to_stat</name>
               <description>AHB Bus Timeout Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>to_sel</name>
               <description>Time Out Interval Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ps_sel</name>
               <description>Time Out Interval Prescale Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>interrupt</name>
               <description>Descriptor Interrupt Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>int_en</name>
               <description>PMU Channel Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>burst_size</name>
               <description>DMA Maximum Burst Size</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- LOOP: Channel Loop Counters -->
      <register>
         <name>LOOP</name>
         <description>Channel Loop Counters</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>counter_0</name>
               <description>CH1 Loop Counter 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>counter_1</name>
               <description>CH1 Loop Counter 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:16]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- OP: Current Descriptor DWORD 0 (OP) -->
      <register>
         <name>OP</name>
         <description>Current Descriptor DWORD 0 (OP)</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
      </register>

   <!-- DSC1: Current Descriptor DWORD 1 -->
      <register>
         <name>DSC1</name>
         <description>Current Descriptor DWORD 1</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
      </register>

