cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- EP5: USB Endpoint 5 Control Register -->
      <register>
         <name>EP5</name>
         <description>USB Endpoint 5 Control Register</description>
         <addressOffset>0x0294</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>ep_dir</name>
               <description>Endpoint Direction</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_buf2</name>
               <description>Endpoint Double Buffered Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_int_en</name>
               <description>Endpoint Transfer Complete Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_nak_en</name>
               <description>Endpoint NAK Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_dt</name>
               <description>Endpoint Data Toggle Clear</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_stall</name>
               <description>Endpoint Stall</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_st_stall</name>
               <description>Endpoint Stall Status Stage of Control Transfer</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_st_ack</name>
               <description>Endpoint Acknowledge Status Stage of Control Transfer</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- EP6: USB Endpoint 6 Control Register -->
      <register>
         <name>EP6</name>
         <description>USB Endpoint 6 Control Register</description>
         <addressOffset>0x0298</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>ep_dir</name>
               <description>Endpoint Direction</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_buf2</name>
               <description>Endpoint Double Buffered Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_int_en</name>
               <description>Endpoint Transfer Complete Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_nak_en</name>
               <description>Endpoint NAK Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_dt</name>
               <description>Endpoint Data Toggle Clear</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_stall</name>
               <description>Endpoint Stall</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_st_stall</name>
               <description>Endpoint Stall Status Stage of Control Transfer</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_st_ack</name>
               <description>Endpoint Acknowledge Status Stage of Control Transfer</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- EP7: USB Endpoint 7 Control Register -->
      <register>
         <name>EP7</name>
         <description>USB Endpoint 7 Control Register</description>
         <addressOffset>0x029C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>ep_dir</name>
               <description>Endpoint Direction</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_buf2</name>
               <description>Endpoint Double Buffered Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_int_en</name>
               <description>Endpoint Transfer Complete Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_nak_en</name>
               <description>Endpoint NAK Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_dt</name>
               <description>Endpoint Data Toggle Clear</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_stall</name>
               <description>Endpoint Stall</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_st_stall</name>
               <description>Endpoint Stall Status Stage of Control Transfer</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ep_st_ack</name>
               <description>Endpoint Acknowledge Status Stage of Control Transfer</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

