cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- ICC:ICC -->

<peripheral>
   <name>ICC</name>
   <description>Instruction Cache</description>
   <groupName>ICC</groupName>
   <baseAddress>0x40080000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- ID: Device ID Register -->
      <register>
         <name>ID</name>
         <description>Device ID Register</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>rtl_version</name>
               <description>RTL Release Version</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>part_num</name>
               <description>Part Number ID</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>cache_id</name>
               <description>Cache ID</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:10]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- MEM_CFG: Memory Configuration -->
      <register>
         <name>MEM_CFG</name>
         <description>Memory Configuration</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>cache_size</name>
               <description>Cache size</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>main_memory_size</name>
               <description>Main memory size</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:16]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- CTRL_STAT: Control and Status -->
      <register>
         <name>CTRL_STAT</name>
         <description>Control and Status</description>
         <addressOffset>0x0100</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>enable</name>
               <description>Cache Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ready</name>
               <description>Cache Ready Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- INVDT_ALL: Invalidate (Clear) Cache Control -->
      <register>
         <name>INVDT_ALL</name>
         <description>Invalidate (Clear) Cache Control</description>
         <addressOffset>0x0700</addressOffset>
         <access>read-write</access>
      </register>

   </registers>
</peripheral>


<!-- SYSMAN:CLKMAN -->

<peripheral>
   <name>CLKMAN</name>
   <description>System Clock Manager</description>
   <groupName>SYSMAN</groupName>
   <baseAddress>0x40090400</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0400</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CLK_CONFIG: System Clock Configuration -->
      <register>
         <name>CLK_CONFIG</name>
         <description>System Clock Configuration</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>hfx_enable</name>
               <description>HFX Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hfx_bypass</name>
               <description>HFX Bypass</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hfx_test_enable</name>
               <description>Reserved Field; Do Not Modify</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hfx_gm_adjust</name>
               <description>HFX GM Adjust</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>hfx_dc_control</name>
               <description>HFX DC Control</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pll_enable</name>
               <description>PLL Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pll_reset_n</name>
               <description>PLL ResetN</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pll_input_select</name>
               <description>PLL Input Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pll_divisor_select</name>
               <description>PLL Divisor Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pll_8mhz_enable</name>
               <description>PLL 8MHz Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pll_bypass</name>
               <description>Reserved Field; Do Not Modify</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pll_stability_count</name>
               <description>PLL Stability Count Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>crypto_enable</name>
               <description>Crypto Oscillator Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>crypto_reset_n</name>
               <description>Crypto Oscillator ResetN</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>crypto_stability_count</name>
               <description>Crypto Oscillator Stability Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL: System Clock Controls -->
      <register>
         <name>CLK_CTRL</name>
         <description>System Clock Controls</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>system_source_select</name>
               <description>System Clock Source Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>auto_clk_disable</name>
               <description>Auto Clock Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>usb_gate_n</name>
               <description>USB Clock GateN</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_gate_n</name>
               <description>ADC Clock GateN</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_source_select</name>
               <description>ADC Clock Source Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>crypto_gate_n</name>
               <description>Crypto Clock GateN</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>watchdog0_gate_n</name>
               <description>Watchdog 0 Clock GateN</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>watchdog0_source_select</name>
               <description>Watchdog 0 Clock Source Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>watchdog1_gate_n</name>
               <description>Watchdog 1 Clock GateN</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>watchdog1_source_select</name>
               <description>Watchdog 1 Clock Source Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:21]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rtos_mode</name>
               <description>RTOS Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INTFL: Interrupt Flags -->
      <register>
         <name>INTFL</name>
         <description>Interrupt Flags</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>ring_stable</name>
               <description>24MHz Relaxation Osc Stable Int Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pll_stable</name>
               <description>PLL Output Stable Int Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>crypto_stable</name>
               <description>Crypto Oscillator Stable Int Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- INTEN: Interrupt Enable/Disable Controls -->
      <register>
         <name>INTEN</name>
         <description>Interrupt Enable/Disable Controls</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>ring_stable</name>
               <description>24MHz Relaxation Oscillator Stable Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pll_stable</name>
               <description>PLL Output Stable Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>crypto_stable</name>
               <description>Crypto Oscillator Stable Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- TRIM_CALC: Trim Calculation Controls -->
      <register>
         <name>TRIM_CALC</name>
         <description>Trim Calculation Controls</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>trim_clk_sel</name>
               <description>Trim Clock Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>trim_calc_start</name>
               <description>Start Trim Calculation</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>trim_calc_completed</name>
               <description>Trim Calculation Completed</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>trim_enable</name>
               <description>Trim Logic Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>trim_calc_results</name>
               <description>Trim Calculation Results</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:16]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- I2C_TIMER_CTRL: I2C Timer Control -->
      <register>
         <name>I2C_TIMER_CTRL</name>
         <description>I2C Timer Control</description>
         <addressOffset>0x0024</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>i2c_1ms_timer_en</name>
               <description>I2C 1ms Timer Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_0_SYSTEM: Control Settings for CLK0 - System Clock -->
      <register>
         <name>CLK_CTRL_0_SYSTEM</name>
         <description>Control Settings for CLK0 - System Clock</description>
         <addressOffset>0x0040</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>sys_clk_scale</name>
               <description>Control Settings for CLK0 - System Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_1_GPIO: Control Settings for CLK1 - GPIO Module Clock -->
      <register>
         <name>CLK_CTRL_1_GPIO</name>
         <description>Control Settings for CLK1 - GPIO Module Clock</description>
         <addressOffset>0x0044</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>gpio_clk_scale</name>
               <description>Control Settings for CLK1 - GPIO Module Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_2_PT: Control Settings for CLK2 - Pulse Train Module Clock -->
      <register>
         <name>CLK_CTRL_2_PT</name>
         <description>Control Settings for CLK2 - Pulse Train Module Clock</description>
         <addressOffset>0x0048</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pulse_train_clk_scale</name>
               <description>Control Settings for CLK2 - Pulse Train Module Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

