cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- CLK_CTRL_3_SPI0: Control Settings for CLK3 - SPI0 Master Clock -->
      <register>
         <name>CLK_CTRL_3_SPI0</name>
         <description>Control Settings for CLK3 - SPI0 Master Clock</description>
         <addressOffset>0x004C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>spi0_clk_scale</name>
               <description>Control Settings for CLK3 - SPI0 Master Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_4_SPI1: Control Settings for CLK4 - SPI1 Master Clock -->
      <register>
         <name>CLK_CTRL_4_SPI1</name>
         <description>Control Settings for CLK4 - SPI1 Master Clock</description>
         <addressOffset>0x0050</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>spi1_clk_scale</name>
               <description>Control Settings for CLK4 - SPI1 Master Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_5_SPI2: Control Settings for CLK5 - SPI2 Master Clock -->
      <register>
         <name>CLK_CTRL_5_SPI2</name>
         <description>Control Settings for CLK5 - SPI2 Master Clock</description>
         <addressOffset>0x0054</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>spi2_clk_scale</name>
               <description>Control Settings for CLK5 - SPI2 Master Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_6_I2CM: Control Settings for CLK6 - Clock for all I2C Masters -->
      <register>
         <name>CLK_CTRL_6_I2CM</name>
         <description>Control Settings for CLK6 - Clock for all I2C Masters</description>
         <addressOffset>0x0058</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>i2cm_clk_scale</name>
               <description>Control Settings for CLK6 - Clock for all I2C Masters</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_7_I2CS: Control Settings for CLK7 - I2C Slave Clock -->
      <register>
         <name>CLK_CTRL_7_I2CS</name>
         <description>Control Settings for CLK7 - I2C Slave Clock</description>
         <addressOffset>0x005C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>i2cs_clk_scale</name>
               <description>Control Settings for CLK7 - I2C Slave Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_8_LCD_CHPUMP: Control Settings for CLK8 - LCD Charge Pump Clock -->
      <register>
         <name>CLK_CTRL_8_LCD_CHPUMP</name>
         <description>Control Settings for CLK8 - LCD Charge Pump Clock</description>
         <addressOffset>0x0060</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>lcd_clk_scale</name>
               <description>Control Settings for CLK8 - LCD Charge Pump Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_9_PUF: Control Settings for CLK9 - PUF Clock -->
      <register>
         <name>CLK_CTRL_9_PUF</name>
         <description>Control Settings for CLK9 - PUF Clock</description>
         <addressOffset>0x0064</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>puf_clk_scale</name>
               <description>Control Settings for CLK9 - PUF Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_10_PRNG: Control Settings for CLK10 - PRNG Clock -->
      <register>
         <name>CLK_CTRL_10_PRNG</name>
         <description>Control Settings for CLK10 - PRNG Clock</description>
         <addressOffset>0x0068</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>prng_clk_scale</name>
               <description>Control Settings for CLK10 - PRNG Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_11_WDT0: Control Settings for CLK11 - Watchdog Timer 0 ScaledSysClk -->
      <register>
         <name>CLK_CTRL_11_WDT0</name>
         <description>Control Settings for CLK11 - Watchdog Timer 0 ScaledSysClk</description>
         <addressOffset>0x006C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>watchdog0_clk_scale</name>
               <description>Control Settings for CLK11 - Watchdog Timer 0 ScaledSysClk</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_12_WDT1: Control Settings for CLK12 - Watchdog Timer 1 ScaledSysClk -->
      <register>
         <name>CLK_CTRL_12_WDT1</name>
         <description>Control Settings for CLK12 - Watchdog Timer 1 ScaledSysClk</description>
         <addressOffset>0x0070</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>watchdog1_clk_scale</name>
               <description>Control Settings for CLK12 - Watchdog Timer 1 ScaledSysClk</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_13_RTC_INT_SYNC: Control Settings for CLK13 - RTC Interrupt Sync Clock -->
      <register>
         <name>CLK_CTRL_13_RTC_INT_SYNC</name>
         <description>Control Settings for CLK13 - RTC Interrupt Sync Clock</description>
         <addressOffset>0x0074</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>rtc_clk_scale</name>
               <description>Control Settings for CLK13 - RTC Interrupt Sync Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_14_DAC0: Control Settings for CLK14 - 12-bit DAC 0 Clock -->
      <register>
         <name>CLK_CTRL_14_DAC0</name>
         <description>Control Settings for CLK14 - 12-bit DAC 0 Clock</description>
         <addressOffset>0x0078</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>dac0_clk_scale</name>
               <description>Control Settings for CLK14 - 12-bit DAC 0 Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_15_DAC1: Control Settings for CLK15 - 12-bit DAC 1 Clock -->
      <register>
         <name>CLK_CTRL_15_DAC1</name>
         <description>Control Settings for CLK15 - 12-bit DAC 1 Clock</description>
         <addressOffset>0x007C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>dac1_clk_scale</name>
               <description>Control Settings for CLK15 - 12-bit DAC 1 Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_16_DAC2: Control Settings for CLK16 - 8-bit DAC 0 Clock -->
      <register>
         <name>CLK_CTRL_16_DAC2</name>
         <description>Control Settings for CLK16 - 8-bit DAC 0 Clock</description>
         <addressOffset>0x0080</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>dac2_clk_scale</name>
               <description>Control Settings for CLK16 - 8-bit DAC 0 Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_CTRL_17_DAC3: Control Settings for CLK17 - 8-bit DAC 1 Clock -->
      <register>
         <name>CLK_CTRL_17_DAC3</name>
         <description>Control Settings for CLK17 - 8-bit DAC 1 Clock</description>
         <addressOffset>0x0084</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>dac3_clk_scale</name>
               <description>Control Settings for CLK17 - 8-bit DAC 1 Clock</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

