cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- CRYPT_CLK_CTRL_0_AES: Control Settings for Crypto Clock 0 - AES -->
      <register>
         <name>CRYPT_CLK_CTRL_0_AES</name>
         <description>Control Settings for Crypto Clock 0 - AES</description>
         <addressOffset>0x0100</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>aes_clk_scale</name>
               <description>Control Settings for Crypto Clock 0 - AES</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CRYPT_CLK_CTRL_1_MAA: Control Settings for Crypto Clock 1 - MAA -->
      <register>
         <name>CRYPT_CLK_CTRL_1_MAA</name>
         <description>Control Settings for Crypto Clock 1 - MAA</description>
         <addressOffset>0x0104</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>umaa_clk_scale</name>
               <description>Control Settings for Crypto Clock 1 - MAA</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CRYPT_CLK_CTRL_2_PRNG: Control Settings for Crypto Clock 2 - PRNG -->
      <register>
         <name>CRYPT_CLK_CTRL_2_PRNG</name>
         <description>Control Settings for Crypto Clock 2 - PRNG</description>
         <addressOffset>0x0108</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>prng_clk_scale</name>
               <description>Control Settings for Crypto Clock 2 - PRNG</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_GATE_CTRL0: Dynamic Clock Gating Control Register 0 -->
      <register>
         <name>CLK_GATE_CTRL0</name>
         <description>Dynamic Clock Gating Control Register 0</description>
         <addressOffset>0x0140</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>cm3_clk_gater</name>
               <description>Clock Gating Control for CM3 CPU</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sysbus_clk_gater</name>
               <description>Clock Gating Control for SysBus</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>icache_clk_gater</name>
               <description>Clock Gating Control for Instruction Cache</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>flash_clk_gater</name>
               <description>Clock Gating Control for Flash Memory</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sram_clk_gater</name>
               <description>Clock Gating Control for SRAM</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>apb_bridge_clk_gater</name>
               <description>Clock Gating Control for AHB-to-APB Bridge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sysman_clk_gater</name>
               <description>Clock Gating Control for Clkman/Pwrman/IOman</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>uart0_clk_gater</name>
               <description>Clock Gating Control for UART 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>uart1_clk_gater</name>
               <description>Clock Gating Control for UART 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>timer0_clk_gater</name>
               <description>Clock Gating Control for Timer Module 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>timer1_clk_gater</name>
               <description>Clock Gating Control for Timer Module 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>timer2_clk_gater</name>
               <description>Clock Gating Control for Timer Module 2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>timer3_clk_gater</name>
               <description>Clock Gating Control for Timer Module 3</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>watchdog0_clk_gater</name>
               <description>Clock Gating Control for WDT 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>watchdog1_clk_gater</name>
               <description>Clock Gating Control for WDT 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>usb_clk_gater</name>
               <description>Clock Gating Control for USB</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:30]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_GATE_CTRL1: Dynamic Clock Gating Control Register 1 -->
      <register>
         <name>CLK_GATE_CTRL1</name>
         <description>Dynamic Clock Gating Control Register 1</description>
         <addressOffset>0x0144</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>testacc_clk_gater</name>
               <description>Clock Gating Control for TestAcc</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc_clk_gater</name>
               <description>Clock Gating Control for ADC</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac12_0_clk_gater</name>
               <description>Clock Gating Control for DAC0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac12_1_clk_gater</name>
               <description>Clock Gating Control for DAC1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac8_0_clk_gater</name>
               <description>Clock Gating Control for DAC2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac8_1_clk_gater</name>
               <description>Clock Gating Control for DAC3</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pmu_clk_gater</name>
               <description>Clock Gating Control for DMA (PMU)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lcd_clk_gater</name>
               <description>Clock Gating Control for LCD</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>gpio_clk_gater</name>
               <description>Clock Gating Control for GPIO</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pulsetrain_clk_gater</name>
               <description>Clock Gating Control for Pulse Train Generators</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spi0_clk_gater</name>
               <description>Clock Gating Control for SPI 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spi1_clk_gater</name>
               <description>Clock Gating Control for SPI 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spi2_clk_gater</name>
               <description>Clock Gating Control for SPI 2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>i2cm0_clk_gater</name>
               <description>Clock Gating Control for I2C Master 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>i2cm1_clk_gater</name>
               <description>Clock Gating Control for I2C Master 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>i2cs_clk_gater</name>
               <description>Clock Gating Control for I2C Slave</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:30]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CLK_GATE_CTRL2: Dynamic Clock Gating Control Register 2 -->
      <register>
         <name>CLK_GATE_CTRL2</name>
         <description>Dynamic Clock Gating Control Register 2</description>
         <addressOffset>0x0148</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>crc_clk_gater</name>
               <description>Clock Gating Control for CRC16/32 Engine</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tpu_clk_gater</name>
               <description>Clock Gating Control for TPU</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ssbmux_clk_gater</name>
               <description>Clock Gating Control for SSB Mux</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pad_clk_gater</name>
               <description>Clock Gating Control for Pad Interface</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:6]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

