cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- SYSMAN:PWRMAN -->

<peripheral>
   <name>PWRMAN</name>
   <description>System Power Manager</description>
   <groupName>SYSMAN</groupName>
   <baseAddress>0x40090800</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0200</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- PWR_RST_CTRL: Power Reset Control and Status -->
      <register>
         <name>PWR_RST_CTRL</name>
         <description>Power Reset Control and Status</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>flash_active</name>
               <description>Flash Active (Not Used)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sram_active</name>
               <description>SRAM Active (Not Used)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>afe_powered</name>
               <description>AFE Powered</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_active</name>
               <description>I/O Active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>usb_powered</name>
               <description>USB Powered</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pullups_enabled</name>
               <description>Static Pullups Enabled</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>firmware_reset</name>
               <description>Firmware Initiated Reset</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>arm_lockup_reset</name>
               <description>ARM Lockup Reset</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>wud_clear</name>
               <description>I/O WUD Clear</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tamper_detect</name>
               <description>Reset Caused By - Tamper Detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>fw_command_sysman</name>
               <description>Reset Caused By - Firmware Commanded Reset (SysMan)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>watchdog_timeout</name>
               <description>Reset Caused By - Watchdog Reset</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>fw_command_arm</name>
               <description>Reset Caused By - Firmware Commanded Reset (ARM Core)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>arm_lockup</name>
               <description>Reset Caused By - ARM Lockup</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>srstn_assertion</name>
               <description>Reset Caused By - External System Reset</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:21]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>por</name>
               <description>Reset Caused By - Power On Reset (POR)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:22]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>low_power_mode</name>
               <description>Power Manager Dynamic Clock Gating Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:31]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INTFL: Interrupt Flags -->
      <register>
         <name>INTFL</name>
         <description>Interrupt Flags</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>v1_8_warning</name>
               <description>1.8V Warning Monitor Int Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>v3_3_warning</name>
               <description>3.3V Warning Monitor Int Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rtc_warning</name>
               <description>RTC Warning Monitor Int Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>v3_3_reset</name>
               <description>3.3V Reset Monitor Int Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>vdda_warning</name>
               <description>VddA Warning Monitor Int Flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- INTEN: Interrupt Enable/Disable Controls -->
      <register>
         <name>INTEN</name>
         <description>Interrupt Enable/Disable Controls</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>v1_8_warning</name>
               <description>1.8V Warning Monitor Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>v3_3_warning</name>
               <description>3.3V Warning Monitor Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rtc_warning</name>
               <description>RTC Warning Monitor Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>v3_3_reset</name>
               <description>3.3V Reset Monitor Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>vdda_warning</name>
               <description>VddA Warning Monitor Int Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- SVM_EVENTS: SVM Event Status Flags (read-only) -->
      <register>
         <name>SVM_EVENTS</name>
         <description>SVM Event Status Flags (read-only)</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>v1_8_warning</name>
               <description>1.8V Warning Monitor Event Input</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>v3_3_warning</name>
               <description>3.3V Warning Monitor Event Input</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rtc_warning</name>
               <description>RTC Warning Monitor Event Input</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>v3_3_reset</name>
               <description>3.3V Reset Monitor Event Input</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>vdda_warning</name>
               <description>VddA Warning Monitor Event Input</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

