cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- BASE_PART_NUM: Base Part Number -->
      <register>
         <name>BASE_PART_NUM</name>
         <description>Base Part Number</description>
         <addressOffset>0x003C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>base_part_number</name>
               <description>Base Part Number</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>package_select</name>
               <description>Package Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:28]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- MASK_ID0: Mask ID Register 0 -->
      <register>
         <name>MASK_ID0</name>
         <description>Mask ID Register 0</description>
         <addressOffset>0x0040</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>revision_id</name>
               <description>Revision ID</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>mask_id</name>
               <description>Mask ID[27:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:4]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- MASK_ID1: Mask ID Register 1 -->
      <register>
         <name>MASK_ID1</name>
         <description>Mask ID Register 1</description>
         <addressOffset>0x0044</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mask_id</name>
               <description>Mask ID[58:28]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>mask_id_enable</name>
               <description>Enable Mask ID</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:31]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- PERIPHERAL_RESET: Peripheral Reset Control Register -->
      <register>
         <name>PERIPHERAL_RESET</name>
         <description>Peripheral Reset Control Register</description>
         <addressOffset>0x0048</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>uart0</name>
               <description>Reset UART0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>uart1</name>
               <description>Reset UART1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>timer0</name>
               <description>Reset Timer0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>timer1</name>
               <description>Reset Timer1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>timer2</name>
               <description>Reset Timer2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>timer3</name>
               <description>Reset Timer3</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>watchdog0</name>
               <description>Reset Watchdog Timer 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>usb</name>
               <description>Reset USB</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>adc</name>
               <description>Reset ADC</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac0</name>
               <description>Reset 12-Bit DAC 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac1</name>
               <description>Reset 12-Bit DAC 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac2</name>
               <description>Reset 8-Bit DAC 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dac3</name>
               <description>Reset 8-Bit DAC 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>dma</name>
               <description>Reset DMA/PMU</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>lcd</name>
               <description>Reset LCD</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>gpio</name>
               <description>Reset GPIO Module</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pulse_train</name>
               <description>Reset All Pulse Trains</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spi0</name>
               <description>Reset SPI 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spi1</name>
               <description>Reset SPI 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>spi2</name>
               <description>Reset SPI 2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>i2cm0</name>
               <description>Reset I2C Master 0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>i2cm1</name>
               <description>Reset I2C Master 1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:21]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>i2cs</name>
               <description>Reset I2C Slave</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>crc</name>
               <description>Reset CRC Engine</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:23]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>tpu</name>
               <description>Reset TPU</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ssb</name>
               <description>Reset RTC SSB</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

