cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- SYSMAN:IOMAN -->

<peripheral>
   <name>IOMAN</name>
   <description>System I/O Manager</description>
   <groupName>SYSMAN</groupName>
   <baseAddress>0x40090C00</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0400</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- WUD_REQ0: Wakeup Detect Mode Request Register 0 (P0/P1/P2/P3) -->
      <register>
         <name>WUD_REQ0</name>
         <description>Wakeup Detect Mode Request Register 0 (P0/P1/P2/P3)</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>port0</name>
               <description>Wakeup Detect Request Mode: P0[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port1</name>
               <description>Wakeup Detect Request Mode: P1[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port2</name>
               <description>Wakeup Detect Request Mode: P2[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port3</name>
               <description>Wakeup Detect Request Mode: P3[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- WUD_REQ1: Wakeup Detect Mode Request Register 1 (P4/P5/P6/P7) -->
      <register>
         <name>WUD_REQ1</name>
         <description>Wakeup Detect Mode Request Register 1 (P4/P5/P6/P7)</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>port4</name>
               <description>Wakeup Detect Request Mode: P4[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port5</name>
               <description>Wakeup Detect Request Mode: P5[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port6</name>
               <description>Wakeup Detect Request Mode: P6[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port7</name>
               <description>Wakeup Detect Request Mode: P7[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- WUD_ACK0: Wakeup Detect Mode Acknowledge Register 0 (P0/P1/P2/P3) -->
      <register>
         <name>WUD_ACK0</name>
         <description>Wakeup Detect Mode Acknowledge Register 0 (P0/P1/P2/P3)</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>port0</name>
               <description>WUD Mode Acknowledge: P0[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port1</name>
               <description>WUD Mode Acknowledge: P1[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port2</name>
               <description>WUD Mode Acknowledge: P2[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port3</name>
               <description>WUD Mode Acknowledge: P3[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- WUD_ACK1: Wakeup Detect Mode Acknowledge Register 1 (P4/P5/P6/P7) -->
      <register>
         <name>WUD_ACK1</name>
         <description>Wakeup Detect Mode Acknowledge Register 1 (P4/P5/P6/P7)</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>port4</name>
               <description>WUD Mode Acknowledge: P4[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port5</name>
               <description>WUD Mode Acknowledge: P5[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port6</name>
               <description>WUD Mode Acknowledge: P6[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port7</name>
               <description>WUD Mode Acknowledge: P7[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- ALI_REQ0: Analog Input Request Register 0 (P0/P1/P2/P3) -->
      <register>
         <name>ALI_REQ0</name>
         <description>Analog Input Request Register 0 (P0/P1/P2/P3)</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>port0</name>
               <description>Analog Input Mode Request: P0[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port1</name>
               <description>Analog Input Mode Request: P1[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port2</name>
               <description>Analog Input Mode Request: P2[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port3</name>
               <description>Analog Input Mode Request: P3[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

