cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- ALI_REQ1: Analog Input Request Register 1 (P4/P5/P6/P7) -->
      <register>
         <name>ALI_REQ1</name>
         <description>Analog Input Request Register 1 (P4/P5/P6/P7)</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>port4</name>
               <description>Analog Input Mode Request: P4[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port5</name>
               <description>Analog Input Mode Request: P5[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port6</name>
               <description>Analog Input Mode Request: P6[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>port7</name>
               <description>Analog Input Mode Request: P7[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- ALI_ACK0: Analog Input Acknowledge Register 0 (P0/P1/P2/P3) -->
      <register>
         <name>ALI_ACK0</name>
         <description>Analog Input Acknowledge Register 0 (P0/P1/P2/P3)</description>
         <addressOffset>0x0018</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>port0</name>
               <description>Analog In Mode Acknowledge: P0[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port1</name>
               <description>Analog In Mode Acknowledge: P1[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port2</name>
               <description>Analog In Mode Acknowledge: P2[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port3</name>
               <description>Analog In Mode Acknowledge: P3[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- ALI_ACK1: Analog Input Acknowledge Register 1 (P4/P5/P6/P7) -->
      <register>
         <name>ALI_ACK1</name>
         <description>Analog Input Acknowledge Register 1 (P4/P5/P6/P7)</description>
         <addressOffset>0x001C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>port4</name>
               <description>Analog In Mode Acknowledge: P4[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port5</name>
               <description>Analog In Mode Acknowledge: P5[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port6</name>
               <description>Analog In Mode Acknowledge: P6[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>port7</name>
               <description>Analog In Mode Acknowledge: P7[7:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:24]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- SPI0_REQ: SPI0 I/O Mode Request -->
      <register>
         <name>SPI0_REQ</name>
         <description>SPI0 I/O Mode Request</description>
         <addressOffset>0x0020</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>SPI0 I/O Mapping Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>core_io</name>
               <description>SPI0 Core I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss0_io</name>
               <description>SPI0 SS[0] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss1_io</name>
               <description>SPI0 SS[1] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss2_io</name>
               <description>SPI0 SS[2] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss3_io</name>
               <description>SPI0 SS[3] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss4_io</name>
               <description>SPI0 SS[4] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sr0_io</name>
               <description>SPI0 SR[0] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sr1_io</name>
               <description>SPI0 SR[1] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>quad_io</name>
               <description>SPI0 Quad I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fast_mode</name>
               <description>SPI0 Fast Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- SPI0_ACK: SPI0 I/O Mode Acknowledge -->
      <register>
         <name>SPI0_ACK</name>
         <description>SPI0 I/O Mode Acknowledge</description>
         <addressOffset>0x0024</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>SPI0 I/O Mapping Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>core_io</name>
               <description>SPI0 Core I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss0_io</name>
               <description>SPI0 SS[0] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss1_io</name>
               <description>SPI0 SS[1] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss2_io</name>
               <description>SPI0 SS[2] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss3_io</name>
               <description>SPI0 SS[3] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss4_io</name>
               <description>SPI0 SS[4] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>sr0_io</name>
               <description>SPI0 SR[0] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>sr1_io</name>
               <description>SPI0 SR[1] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>quad_io</name>
               <description>SPI0 Quad I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>fast_mode</name>
               <description>SPI0 Fast Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

