cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- SPI1_REQ: SPI1 I/O Mode Request -->
      <register>
         <name>SPI1_REQ</name>
         <description>SPI1 I/O Mode Request</description>
         <addressOffset>0x0028</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>SPI1 I/O Mapping Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>core_io</name>
               <description>SPI1 Core I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss0_io</name>
               <description>SPI1 SS[0] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss1_io</name>
               <description>SPI1 SS[1] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss2_io</name>
               <description>SPI1 SS[2] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss3_io</name>
               <description>SPI1 SS[3] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss4_io</name>
               <description>SPI1 SS[4] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sr0_io</name>
               <description>SPI1 SR[0] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sr1_io</name>
               <description>SPI1 SR[1] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>quad_io</name>
               <description>SPI1 Quad I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fast_mode</name>
               <description>SPI1 Fast Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- SPI1_ACK: SPI1 I/O Mode Acknowledge -->
      <register>
         <name>SPI1_ACK</name>
         <description>SPI1 I/O Mode Acknowledge</description>
         <addressOffset>0x002C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>SPI1 I/O Mapping Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>core_io</name>
               <description>SPI1 Core I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss0_io</name>
               <description>SPI1 SS[0] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss1_io</name>
               <description>SPI1 SS[1] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss2_io</name>
               <description>SPI1 SS[2] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss3_io</name>
               <description>SPI1 SS[3] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss4_io</name>
               <description>SPI1 SS[4] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>sr0_io</name>
               <description>SPI1 SR[0] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>sr1_io</name>
               <description>SPI1 SR[1] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>quad_io</name>
               <description>SPI1 Quad I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>fast_mode</name>
               <description>SPI1 Fast Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- SPI2_REQ: SPI2 I/O Mode Request -->
      <register>
         <name>SPI2_REQ</name>
         <description>SPI2 I/O Mode Request</description>
         <addressOffset>0x0030</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>SPI2 I/O Mapping Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>core_io</name>
               <description>SPI2 Core I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss0_io</name>
               <description>SPI2 SS[0] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss1_io</name>
               <description>SPI2 SS[1] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss2_io</name>
               <description>SPI2 SS[2] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss3_io</name>
               <description>SPI2 SS[3] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>ss4_io</name>
               <description>SPI2 SS[4] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sr0_io</name>
               <description>SPI2 SR[0] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>sr1_io</name>
               <description>SPI2 SR[1] I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>quad_io</name>
               <description>SPI2 Quad I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>fast_mode</name>
               <description>SPI2 Fast Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- SPI2_ACK: SPI2 I/O Mode Acknowledge -->
      <register>
         <name>SPI2_ACK</name>
         <description>SPI2 I/O Mode Acknowledge</description>
         <addressOffset>0x0034</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>SPI2 I/O Mapping Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>core_io</name>
               <description>SPI2 Core I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss0_io</name>
               <description>SPI2 SS[0] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss1_io</name>
               <description>SPI2 SS[1] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss2_io</name>
               <description>SPI2 SS[2] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss3_io</name>
               <description>SPI2 SS[3] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>ss4_io</name>
               <description>SPI2 SS[4] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>sr0_io</name>
               <description>SPI2 SR[0] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>sr1_io</name>
               <description>SPI2 SR[1] I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>quad_io</name>
               <description>SPI2 Quad I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>fast_mode</name>
               <description>SPI2 Fast Mode Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- UART0_REQ: UART0 I/O Mode Request -->
      <register>
         <name>UART0_REQ</name>
         <description>UART0 I/O Mode Request</description>
         <addressOffset>0x0038</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>UART0 I/O Mapping Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>core_io</name>
               <description>UART0 Core I/O (RX/TX) Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>cts_io</name>
               <description>UART0 CTS I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rts_io</name>
               <description>UART0 RTS I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- UART0_ACK: UART0 I/O Mode Acknowledge -->
      <register>
         <name>UART0_ACK</name>
         <description>UART0 I/O Mode Acknowledge</description>
         <addressOffset>0x003C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>UART0 I/O Mapping Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>core_io</name>
               <description>UART0 Core I/O (RX/TX) Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>cts_io</name>
               <description>UART0 CTS I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rts_io</name>
               <description>UART0 RTS I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- UART1_REQ: UART1 I/O Mode Request -->
      <register>
         <name>UART1_REQ</name>
         <description>UART1 I/O Mode Request</description>
         <addressOffset>0x0040</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>UART1 I/O Mapping Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>core_io</name>
               <description>UART1 Core I/O (RX/TX) Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>cts_io</name>
               <description>UART1 CTS I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rts_io</name>
               <description>UART1 RTS I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- UART1_ACK: UART1 I/O Mode Acknowledge -->
      <register>
         <name>UART1_ACK</name>
         <description>UART1 I/O Mode Acknowledge</description>
         <addressOffset>0x0044</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>UART0 I/O Mapping Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>core_io</name>
               <description>UART1 Core I/O (RX/TX) Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>cts_io</name>
               <description>UART1 CTS I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rts_io</name>
               <description>UART1 RTS I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- I2CM0_REQ: I2C Master 0 I/O Request -->
      <register>
         <name>I2CM0_REQ</name>
         <description>I2C Master 0 I/O Request</description>
         <addressOffset>0x0048</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>I2C Master I/O Mapping Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>core_io</name>
               <description>I2C Master I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

