cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- I2CM0_ACK: I2C Master 0 I/O Acknowledge -->
      <register>
         <name>I2CM0_ACK</name>
         <description>I2C Master 0 I/O Acknowledge</description>
         <addressOffset>0x004C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>I2C Master I/O Mapping Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>core_io</name>
               <description>I2C Master I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- I2CS0_REQ: I2C Slave 0 I/O Request -->
      <register>
         <name>I2CS0_REQ</name>
         <description>I2C Slave 0 I/O Request</description>
         <addressOffset>0x0050</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>I2C Slave I/O Mapping Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>core_io</name>
               <description>I2C Slave I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- I2CS0_ACK: I2C Slave 0 I/O Acknowledge -->
      <register>
         <name>I2CS0_ACK</name>
         <description>I2C Slave 0 I/O Acknowledge</description>
         <addressOffset>0x0054</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>I2C Slave I/O Mapping Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>core_io</name>
               <description>I2C Slave I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- LCD_COM_REQ: LCD COM Driver I/O Request -->
      <register>
         <name>LCD_COM_REQ</name>
         <description>LCD COM Driver I/O Request</description>
         <addressOffset>0x0058</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>com_io</name>
               <description>LCD COM I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- LCD_COM_ACK: LCD COM Driver I/O Acknowledge -->
      <register>
         <name>LCD_COM_ACK</name>
         <description>LCD COM Driver I/O Acknowledge</description>
         <addressOffset>0x005C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>com_io</name>
               <description>LCD COM I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- LCD_SEG_REQ0: LCD SEG Driver I/O Request Register 0 -->
      <register>
         <name>LCD_SEG_REQ0</name>
         <description>LCD SEG Driver I/O Request Register 0</description>
         <addressOffset>0x0060</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>io_req_24</name>
               <description>LCD SEG I/O Request for GPIO 24</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_25</name>
               <description>LCD SEG I/O Request for GPIO 25</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_26</name>
               <description>LCD SEG I/O Request for GPIO 26</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_27</name>
               <description>LCD SEG I/O Request for GPIO 27</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_28</name>
               <description>LCD SEG I/O Request for GPIO 28</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_29</name>
               <description>LCD SEG I/O Request for GPIO 29</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_30</name>
               <description>LCD SEG I/O Request for GPIO 30</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_31</name>
               <description>LCD SEG I/O Request for GPIO 31</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_32</name>
               <description>LCD SEG I/O Request for GPIO 32</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_33</name>
               <description>LCD SEG I/O Request for GPIO 33</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_34</name>
               <description>LCD SEG I/O Request for GPIO 34</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_35</name>
               <description>LCD SEG I/O Request for GPIO 35</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_36</name>
               <description>LCD SEG I/O Request for GPIO 36</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_37</name>
               <description>LCD SEG I/O Request for GPIO 37</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_38</name>
               <description>LCD SEG I/O Request for GPIO 38</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_39</name>
               <description>LCD SEG I/O Request for GPIO 39</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_40</name>
               <description>LCD SEG I/O Request for GPIO 40</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_41</name>
               <description>LCD SEG I/O Request for GPIO 41</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_42</name>
               <description>LCD SEG I/O Request for GPIO 42</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_43</name>
               <description>LCD SEG I/O Request for GPIO 43</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_44</name>
               <description>LCD SEG I/O Request for GPIO 44</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_45</name>
               <description>LCD SEG I/O Request for GPIO 45</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:21]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_46</name>
               <description>LCD SEG I/O Request for GPIO 46</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:22]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_47</name>
               <description>LCD SEG I/O Request for GPIO 47</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:23]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_48</name>
               <description>LCD SEG I/O Request for GPIO 48</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_49</name>
               <description>LCD SEG I/O Request for GPIO 49</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_50</name>
               <description>LCD SEG I/O Request for GPIO 50</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:26]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_51</name>
               <description>LCD SEG I/O Request for GPIO 51</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:27]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_52</name>
               <description>LCD SEG I/O Request for GPIO 52</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:28]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_53</name>
               <description>LCD SEG I/O Request for GPIO 53</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:29]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_54</name>
               <description>LCD SEG I/O Request for GPIO 54</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:30]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_55</name>
               <description>LCD SEG I/O Request for GPIO 55</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:31]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- LCD_SEG_REQ1: LCD SEG Driver I/O Request Register 1 -->
      <register>
         <name>LCD_SEG_REQ1</name>
         <description>LCD SEG Driver I/O Request Register 1</description>
         <addressOffset>0x0064</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>io_req_56</name>
               <description>LCD SEG I/O Request for GPIO 56</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_57</name>
               <description>LCD SEG I/O Request for GPIO 57</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_58</name>
               <description>LCD SEG I/O Request for GPIO 58</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_59</name>
               <description>LCD SEG I/O Request for GPIO 59</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_60</name>
               <description>LCD SEG I/O Request for GPIO 60</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_61</name>
               <description>LCD SEG I/O Request for GPIO 61</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_62</name>
               <description>LCD SEG I/O Request for GPIO 62</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_63</name>
               <description>LCD SEG I/O Request for GPIO 63</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

