cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- LCD_SEG_ACK0: LCD SEG Driver I/O Acknowledge Register 0 -->
      <register>
         <name>LCD_SEG_ACK0</name>
         <description>LCD SEG Driver I/O Acknowledge Register 0</description>
         <addressOffset>0x0068</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>io_ack_24</name>
               <description>LCD SEG I/O Acknowledge for GPIO 24</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_25</name>
               <description>LCD SEG I/O Acknowledge for GPIO 25</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_26</name>
               <description>LCD SEG I/O Acknowledge for GPIO 26</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_27</name>
               <description>LCD SEG I/O Acknowledge for GPIO 27</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_28</name>
               <description>LCD SEG I/O Acknowledge for GPIO 28</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_29</name>
               <description>LCD SEG I/O Acknowledge for GPIO 29</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_30</name>
               <description>LCD SEG I/O Acknowledge for GPIO 30</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_31</name>
               <description>LCD SEG I/O Acknowledge for GPIO 31</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_32</name>
               <description>LCD SEG I/O Acknowledge for GPIO 32</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_33</name>
               <description>LCD SEG I/O Acknowledge for GPIO 33</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_34</name>
               <description>LCD SEG I/O Acknowledge for GPIO 34</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_35</name>
               <description>LCD SEG I/O Acknowledge for GPIO 35</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_36</name>
               <description>LCD SEG I/O Acknowledge for GPIO 36</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_37</name>
               <description>LCD SEG I/O Acknowledge for GPIO 37</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_38</name>
               <description>LCD SEG I/O Acknowledge for GPIO 38</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_39</name>
               <description>LCD SEG I/O Acknowledge for GPIO 39</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_40</name>
               <description>LCD SEG I/O Acknowledge for GPIO 40</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_41</name>
               <description>LCD SEG I/O Acknowledge for GPIO 41</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_42</name>
               <description>LCD SEG I/O Acknowledge for GPIO 42</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_43</name>
               <description>LCD SEG I/O Acknowledge for GPIO 43</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_44</name>
               <description>LCD SEG I/O Acknowledge for GPIO 44</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_45</name>
               <description>LCD SEG I/O Acknowledge for GPIO 45</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:21]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_46</name>
               <description>LCD SEG I/O Acknowledge for GPIO 46</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:22]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_47</name>
               <description>LCD SEG I/O Acknowledge for GPIO 47</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:23]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_48</name>
               <description>LCD SEG I/O Acknowledge for GPIO 48</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_49</name>
               <description>LCD SEG I/O Acknowledge for GPIO 49</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_50</name>
               <description>LCD SEG I/O Acknowledge for GPIO 50</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:26]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_51</name>
               <description>LCD SEG I/O Acknowledge for GPIO 51</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:27]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_52</name>
               <description>LCD SEG I/O Acknowledge for GPIO 52</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[28:28]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_53</name>
               <description>LCD SEG I/O Acknowledge for GPIO 53</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[29:29]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_54</name>
               <description>LCD SEG I/O Acknowledge for GPIO 54</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:30]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_55</name>
               <description>LCD SEG I/O Acknowledge for GPIO 55</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:31]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- LCD_SEG_ACK1: LCD SEG Driver I/O Acknowledge Register 1 -->
      <register>
         <name>LCD_SEG_ACK1</name>
         <description>LCD SEG Driver I/O Acknowledge Register 1</description>
         <addressOffset>0x006C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>io_ack_56</name>
               <description>LCD SEG I/O Acknowledge for GPIO 56</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_57</name>
               <description>LCD SEG I/O Acknowledge for GPIO 57</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_58</name>
               <description>LCD SEG I/O Acknowledge for GPIO 58</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_59</name>
               <description>LCD SEG I/O Acknowledge for GPIO 59</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_60</name>
               <description>LCD SEG I/O Acknowledge for GPIO 60</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_61</name>
               <description>LCD SEG I/O Acknowledge for GPIO 61</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_62</name>
               <description>LCD SEG I/O Acknowledge for GPIO 62</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_63</name>
               <description>LCD SEG I/O Acknowledge for GPIO 63</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- CRNT_REQ: Current Drive I/O Request Register -->
      <register>
         <name>CRNT_REQ</name>
         <description>Current Drive I/O Request Register</description>
         <addressOffset>0x0070</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>io_req_crnt0</name>
               <description>Request for pair CRNT0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_crnt1</name>
               <description>Request for pair CRNT1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_crnt2</name>
               <description>Request for pair CRNT2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_crnt3</name>
               <description>Request for pair CRNT3</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_crnt4</name>
               <description>Request for pair CRNT4</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_crnt5</name>
               <description>Request for pair CRNT5</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_crnt6</name>
               <description>Request for pair CRNT6</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_req_crnt7</name>
               <description>Request for pair CRNT7</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CRNT_ACK: Current Drive I/O Acknowledge Register -->
      <register>
         <name>CRNT_ACK</name>
         <description>Current Drive I/O Acknowledge Register</description>
         <addressOffset>0x0074</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>io_ack_crnt0</name>
               <description>Acknowledge for pair CRNT0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_crnt1</name>
               <description>Acknowledge for pair CRNT1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_crnt2</name>
               <description>Acknowledge for pair CRNT2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_crnt3</name>
               <description>Acknowledge for pair CRNT3</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_crnt4</name>
               <description>Acknowledge for pair CRNT4</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_crnt5</name>
               <description>Acknowledge for pair CRNT5</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_crnt6</name>
               <description>Acknowledge for pair CRNT6</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>io_ack_crnt7</name>
               <description>Acknowledge for pair CRNT7</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- CRNT_MODE: Current Drive I/O Mode Control -->
      <register>
         <name>CRNT_MODE</name>
         <description>Current Drive I/O Mode Control</description>
         <addressOffset>0x0078</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>io_crnt0</name>
               <description>Current Drive Mode Select for pair CRNT0</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_crnt1</name>
               <description>Current Drive Mode Select for pair CRNT1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_crnt2</name>
               <description>Current Drive Mode Select for pair CRNT2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_crnt3</name>
               <description>Current Drive Mode Select for pair CRNT3</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_crnt4</name>
               <description>Current Drive Mode Select for pair CRNT4</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_crnt5</name>
               <description>Current Drive Mode Select for pair CRNT5</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_crnt6</name>
               <description>Current Drive Mode Select for pair CRNT6</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:24]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>io_crnt7</name>
               <description>Current Drive Mode Select for pair CRNT7</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

