cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- ALI_CONNECT0: Analog I/O Connection Control Register 0 -->
      <register>
         <name>ALI_CONNECT0</name>
         <description>Analog I/O Connection Control Register 0</description>
         <addressOffset>0x007C</addressOffset>
         <access>read-write</access>
      </register>

   <!-- ALI_CONNECT1: Analog I/O Connection Control Register 1 -->
      <register>
         <name>ALI_CONNECT1</name>
         <description>Analog I/O Connection Control Register 1</description>
         <addressOffset>0x0080</addressOffset>
         <access>read-write</access>
      </register>

   <!-- I2CM1_REQ: I2C Master 1 I/O Request -->
      <register>
         <name>I2CM1_REQ</name>
         <description>I2C Master 1 I/O Request</description>
         <addressOffset>0x0084</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>I2C Master I/O Mapping Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>core_io</name>
               <description>I2C Master I/O Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- I2CM1_ACK: I2C Master 1 I/O Acknowledge -->
      <register>
         <name>I2CM1_ACK</name>
         <description>I2C Master 1 I/O Acknowledge</description>
         <addressOffset>0x0088</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>mapping</name>
               <description>I2C Master I/O Mapping Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>core_io</name>
               <description>I2C Master I/O Acknowledge</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- PADX_CONTROL: Multichip Interface Pad Control Register -->
      <register>
         <name>PADX_CONTROL</name>
         <description>Multichip Interface Pad Control Register</description>
         <addressOffset>0x008C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>padx_power_control</name>
               <description>PADX Power Control</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>padx_gpio0_out_mode</name>
               <description>PADX GPIO0 Out Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>padx_gpio0_input_state</name>
               <description>PADX GPIO0 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>padx_gpio1_out_mode</name>
               <description>PADX GPIO1 Out Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>padx_gpio1_input_state</name>
               <description>PADX GPIO1 Input Value</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   </registers>
</peripheral>


<!-- RTC:RTCTMR -->

<peripheral>
   <name>RTCTMR</name>
   <description>Real Time Clock</description>
   <groupName>RTC</groupName>
   <baseAddress>0x40090A00</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0030</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- CTRL: RTC Timer Control -->
      <register>
         <name>CTRL</name>
         <description>RTC Timer Control</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>enable</name>
               <description>RTC Timer Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>clear</name>
               <description>RTC Timer Clear Bit</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pending</name>
               <description>RTC Transaction Pending</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>use_async_flags</name>
               <description>Use Async RTC Flags</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>aggressive_rst</name>
               <description>Use Aggressive Reset Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>en_active</name>
               <description>tmr_en_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>osc_goto_low_active</name>
               <description>osc_goto_low_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>osc_frce_sm_en_active</name>
               <description>osc_frce_sm_en_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>osc_frce_st_active</name>
               <description>osc_frce_st_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>set_active</name>
               <description>timer_set_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>clr_active</name>
               <description>timer_clr_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:21]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>rollover_clr_active</name>
               <description>rollover_clr_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[22:22]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>prescale_cmpr0_active</name>
               <description>prescale_cmpr0_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[23:23]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>prescale_update_active</name>
               <description>prescale_update_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>cmpr1_clr_active</name>
               <description>cmpr1_clr_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>cmpr0_clr_active</name>
               <description>cmpr0_clr_active</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[26:26]</bitRange>
               <access>read-only</access>
            </field>
         </fields>
      </register>

   <!-- TIMER: RTC Timer Count Value -->
      <register>
         <name>TIMER</name>
         <description>RTC Timer Count Value</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
      </register>

   <!-- COMP0: RTC Time of Day Alarm 0 Compare Register -->
      <register>
         <name>COMP0</name>
         <description>RTC Time of Day Alarm 0 Compare Register</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
      </register>

   <!-- COMP1: RTC Time of Day Alarm 1 Compare Register -->
      <register>
         <name>COMP1</name>
         <description>RTC Time of Day Alarm 1 Compare Register</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
      </register>

