cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- PWRSEQ:PWRSEQ -->

<peripheral>
   <name>PWRSEQ</name>
   <description>Power Sequencer</description>
   <groupName>PWRSEQ</groupName>
   <baseAddress>0x40090A30</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x0040</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- REG0: Power Sequencer Control Register 0 -->
      <register>
         <name>REG0</name>
         <description>Power Sequencer Control Register 0</description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pwr_lp1</name>
               <description>Shutdown Power Mode Select</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_first_boot</name>
               <description>Wake on First Boot</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_sys_reboot</name>
               <description>Firmware System Reboot Request</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>write-only</access>
            </field>
            <field>
               <name>pwr_ldoen_run</name>
               <description>Enable Main 1.8V LDO Operation in Run Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_ldoen_slp</name>
               <description>Enable Main 1.8V LDO Operation in Sleep Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_chzyen_run</name>
               <description>Enable Backup 1.8V LDO Operation in Run Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_chzyen_slp</name>
               <description>Enable Backup 1.8V LDO Operation in Sleep Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_roen_run</name>
               <description>Enable System Relaxation Oscillator in Run Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_roen_slp</name>
               <description>Enable System Relaxation Oscillator in Sleep Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_nren_run</name>
               <description>Enable Nano Oscillator in Run Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_nren_slp</name>
               <description>Enable Nano Oscillator in Sleep Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_rtcen_run</name>
               <description>Enable Real Time Clock operation in Run Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_rtcen_slp</name>
               <description>Enable Real Time Clock operation in Sleep Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_svm3en_run</name>
               <description>Enable VDD3 SVM operation in Run Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_svm3en_slp</name>
               <description>Enable VDD3 SVM operation in Sleep Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_svm1en_run</name>
               <description>Enable VREG18 SVM operation in Run Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_svm1en_slp</name>
               <description>Enable VREG18 SVM operation in Sleep Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_svmrtcen_run</name>
               <description>Enable VRTC SVM operation in Run Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_svmrtcen_slp</name>
               <description>Enable VRTC SVM operation in Sleep Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_svmvdda3en</name>
               <description>Enable VDDA3 SVM operation (in Run Mode only)</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- REG1: Power Sequencer Control Register 1 -->
      <register>
         <name>REG1</name>
         <description>Power Sequencer Control Register 1</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pwr_trikl_chrg</name>
               <description>Trickle Charge Control for VRTC External Capacitor</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_pd_vdda3</name>
               <description>Power Down VDDA3 Supply Rail</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_temp_sensor_pd</name>
               <description>Power Down Internal Temperature Sensor</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_pd_vddio</name>
               <description>Power Down VDDIO Supply Rail</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_man_vddio_sw</name>
               <description>Manual Override Enable for VDDIO Switch 1/2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_man_vddio_sw2</name>
               <description>Manual Override for VDDIO_SW2</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_man_vddio_sw1</name>
               <description>Manual Override for VDDIO_SW1</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_gpio_freeze</name>
               <description>Freeze GPIO WUD and Keeper Latches</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- REG2: Power Sequencer Control Register 2 -->
      <register>
         <name>REG2</name>
         <description>Power Sequencer Control Register 2</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pwr_rst3</name>
               <description>pwr_rst3_o - VDD3 Reset decode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_w3</name>
               <description>pwr_w3_o[4:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_w1</name>
               <description>pwr_w1_o[4:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_w1_low</name>
               <description>pwr_w1_low_o[4:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_wrtc</name>
               <description>pwr_wrtc_o[4:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_wvdda3</name>
               <description>pwr_wvdda3_o[5:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[30:25]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

