cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- REG3: Power Sequencer Control Register 3 -->
      <register>
         <name>REG3</name>
         <description>Power Sequencer Control Register 3</description>
         <addressOffset>0x000C</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pwr_rosel</name>
               <description>pwr_rosel_o[2:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_rosel_quick</name>
               <description>pwr_rosel_quick_o[1:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_svmsel</name>
               <description>pwr_svmsel_o[2:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_pwrfltrsvmselo</name>
               <description>pwr_pwrfltrsvmselo_o[1:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_pwrfltrrosel</name>
               <description>pwr_pwrfltrrosel_o[2:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_svm_clk_mux</name>
               <description>pwr_svm_clk_mux_o[1:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_ro_clk_mux</name>
               <description>pwr_ro_clk_mux_o</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_quick_cnt</name>
               <description>pwr_quick_cnt_o</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_bo_tc</name>
               <description>Brownout Detection Time Constant</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:17]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- REG4: Power Sequencer Control Register 4 -->
      <register>
         <name>REG4</name>
         <description>Power Sequencer Control Register 4</description>
         <addressOffset>0x0010</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pwr_tm_ps_2_gpio</name>
               <description>pwr_tm_ps_2_gpio_w</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_tm_fast_timers</name>
               <description>pwr_tm_fast_timers_o</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_usb_prot_trim</name>
               <description>pwr_usb_prot_trim_o</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_usb_dis_comp</name>
               <description>pwr_usb_dis_comp_o</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_usb_to_vdd_fast</name>
               <description>pwr_usbToVddFast_w</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_usb_ldo_off</name>
               <description>pwr_usbLdoOff_w</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_usb_frc_vdd</name>
               <description>pwr_usbFrcVdd_w</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- REG5: Power Sequencer Control Register 5 (Trim 0) -->
      <register>
         <name>REG5</name>
         <description>Power Sequencer Control Register 5 (Trim 0)</description>
         <addressOffset>0x0014</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pwr_trim_svm_bg</name>
               <description>pwr_trim_svm_bg_w[5:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_trim_reg1p8</name>
               <description>pwr_trim_reg1p8_w[3:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_trim_reg3p3</name>
               <description>pwr_trim_reg3p3_o[4:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_trim_osc_vref</name>
               <description>pwr_trim_osc_vref_o[6:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:15]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- REG6: Power Sequencer Control Register 6 (Trim 1) -->
      <register>
         <name>REG6</name>
         <description>Power Sequencer Control Register 6 (Trim 1)</description>
         <addressOffset>0x0018</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pwr_trim_usb_bias</name>
               <description>pwr_trim_usb_bias_o[2:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_trim_usb_pm_res</name>
               <description>pwr_trim_usb_pm_res_o[3:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_trim_usb_dm_res</name>
               <description>pwr_trim_usb_dm_res_o[3:0]</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:7]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

