cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- FLAGS: Power Sequencer Flags -->
      <register>
         <name>FLAGS</name>
         <description>Power Sequencer Flags</description>
         <addressOffset>0x0020</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pwr_first_boot</name>
               <description>pwr_first_boot_o</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pwr_sys_reboot</name>
               <description>pwr_sys_reboot_o</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pwr_prv_pwr_fail</name>
               <description>pwr_prv_pwr_fail_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_prv_boot_fail</name>
               <description>pwr_prv_boot_fail_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_comp_wakeup</name>
               <description>pwr_comp_wakeup_latch_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_io_wakeup</name>
               <description>pwr_iowakeup_latch_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_vdd3_rst</name>
               <description>pwr_vdd3_rst_bad_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_vdd3_warn</name>
               <description>pwr_vdd3_warn_bad_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_vdd1_rst</name>
               <description>pwr_vdd1_rst_bad_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_vdd1_low_rst</name>
               <description>pwr_vdd1_low_rst_bad_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_vdd1_warn</name>
               <description>pwr_vdd1_warn_bad_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_vrtc_warn</name>
               <description>pwr_vrtc_warn_bad_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_por3z_fail</name>
               <description>pwr_por3z_fail_latch_r</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rtc_cmpr0</name>
               <description>rtc_cmpr0_flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rtc_cmpr1</name>
               <description>rtc_cmpr1_flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rtc_prescale_cmp</name>
               <description>rtc_prescale_cmp_flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>rtc_rollover</name>
               <description>rtc_rollover_flag</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_brownout_det</name>
               <description>pwr_brownout_detected</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_usb_plug_wakeup</name>
               <description>pwr_usb_plug_wakeup_detected</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_usb_remove_wakeup</name>
               <description>pwr_usb_remove_wakeup_detected</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_vdd22_rst</name>
               <description>pwr_vdd22_rst</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>pwr_vdd195_rst</name>
               <description>pwr_vdd195_rst</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:21]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- MSK_FLAGS: Power Sequencer Flags Mask Register -->
      <register>
         <name>MSK_FLAGS</name>
         <description>Power Sequencer Flags Mask Register</description>
         <addressOffset>0x0024</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>pwr_sys_reboot</name>
               <description>Mask for system reboot detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_prv_pwr_fail</name>
               <description>Mask for previous power fail detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_prv_boot_fail</name>
               <description>Mask for previous boot fail detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_comp_wakeup</name>
               <description>Mask for analog comparator wakeup detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:4]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_io_wakeup</name>
               <description>Mask for GPIO wakeup event detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[5:5]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_vdd3_rst</name>
               <description>Mask for VDD3 reset comparator event detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[6:6]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_vdd3_warn</name>
               <description>Mask for VDD3 voltage warning event detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[7:7]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_vdd1_rst</name>
               <description>Mask for VREG18 reset compare event detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_vdd1_low_rst</name>
               <description>Mask for VREG18 reset LOW compare event</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_vdd1_warn</name>
               <description>Mask for VREG18 warning level event detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[10:10]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_vrtc_warn</name>
               <description>Mask for VRTC power fail detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[11:11]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_por3z_fail</name>
               <description>Mask for POR3Z supply fail event detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[12:12]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rtc_cmpr0</name>
               <description>Mask for RTC compare 0 event</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[13:13]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rtc_cmpr1</name>
               <description>Mask for RTC compare 1 event</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[14:14]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rtc_prescale_cmp</name>
               <description>Mask for RTC prescale compare event</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:15]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>rtc_rollover</name>
               <description>Mask for RTC rollover event</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_brownout_det</name>
               <description>Mask for power brownout detect</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_usb_plug_wakeup</name>
               <description>Mask for USB power connected wakeup event</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[18:18]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_usb_remove_wakeup</name>
               <description>Mask for USB power disconnected wakeup event</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[19:19]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_vdd22_rst</name>
               <description>Mask for VDD22 reset event</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[20:20]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>pwr_vdd195_rst</name>
               <description>Mask for VDD195 reset event</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[21:21]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

