cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   </registers>
</peripheral>


<!-- FLC:FLC -->

<peripheral>
   <name>FLC</name>
   <description>Flash Controller</description>
   <groupName>FLC</groupName>
   <baseAddress>0x400F0000</baseAddress>
   <size>32</size>
   <access>read-write</access>

   <addressBlock>
      <offset>0</offset>
      <size>0x1000</size>
      <usage>registers</usage>
   </addressBlock>

   <registers>

   <!-- FADDR: Flash Operation Address  -->
      <register>
         <name>FADDR</name>
         <description>Flash Operation Address </description>
         <addressOffset>0x0000</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>faddr</name>
               <description>Flash Operation Address</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- FCKDIV: Flash Clock Pulse Divisor -->
      <register>
         <name>FCKDIV</name>
         <description>Flash Clock Pulse Divisor</description>
         <addressOffset>0x0004</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>fckdiv</name>
               <description>Flash Clock Pulse Divisor</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[4:0]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- CTRL: Flash Control Register -->
      <register>
         <name>CTRL</name>
         <description>Flash Control Register</description>
         <addressOffset>0x0008</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>write</name>
               <description>Start Flash Write Operation</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>mass_erase</name>
               <description>Start Flash Mass Erase Operation</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>page_erase</name>
               <description>Start Flash Page Erase Operation</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>erase_code</name>
               <description>Flash Erase Code</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[15:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>info_block_unlock</name>
               <description>Flash Info Block Locked</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[16:16]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>write_enable</name>
               <description>Flash Writes Enabled</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[17:17]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>pending</name>
               <description>Flash Controller Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[24:24]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>info_block_valid</name>
               <description>Info Block Valid Status</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[25:25]</bitRange>
               <access>read-only</access>
            </field>
            <field>
               <name>auto_incre_mode</name>
               <description>Address Auto-Increment Mode</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[27:27]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>flsh_unlock</name>
               <description>Flash Write/Erase Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[31:28]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

   <!-- INTR: Flash Controller Interrupt Flags and Enable/Disable 0 -->
      <register>
         <name>INTR</name>
         <description>Flash Controller Interrupt Flags and Enable/Disable 0</description>
         <addressOffset>0x0024</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>started_if</name>
               <description>Flash Operation Started</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>failed_if</name>
               <description>Flash Operation Failed</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>started_ie</name>
               <description>Flash Operation Started Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[8:8]</bitRange>
               <access>read-write</access>
            </field>
            <field>
               <name>failed_ie</name>
               <description>Flash Operation Failed Interrupt Enable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[9:9]</bitRange>
               <access>read-write</access>
            </field>
         </fields>
      </register>

