cmsis-svd/cmsis-svd/data/Maxim/max32600.svd
   <!-- INTEN1: Interrupt Enable/Disable Register 1 -->
      <register>
         <name>INTEN1</name>
         <description>Interrupt Enable/Disable Register 1</description>
         <addressOffset>0x0148</addressOffset>
         <access>read-write</access>
         <fields>
            <field>
               <name>sram_addr_wrapped</name>
               <description>SRAM Address Wrapped Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[0:0]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>invalid_flash_addr</name>
               <description>Invalid Flash Address Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[1:1]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>flash_read_locked</name>
               <description>Flash Read from Locked Area Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[2:2]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
               <name>trim_update_done</name>
               <description>Trim Update Complete Interrupt Enable/Disable</description>
               <enumeratedValues></enumeratedValues>
               <bitRange>[3:3]</bitRange>
               <access>read-write</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
         </fields>
      </register>

   <!-- DISABLE_XR0: Disable Flash Page Exec/Read Register 0 -->
      <register>
         <name>DISABLE_XR0</name>
         <description>Disable Flash Page Exec/Read Register 0</description>
         <addressOffset>0x0150</addressOffset>
         <access>read-write</access>
      </register>

   <!-- DISABLE_XR1: Disable Flash Page Exec/Read Register 1 -->
      <register>
         <name>DISABLE_XR1</name>
         <description>Disable Flash Page Exec/Read Register 1</description>
         <addressOffset>0x0154</addressOffset>
         <access>read-write</access>
      </register>

   <!-- DISABLE_XR2: Disable Flash Page Exec/Read Register 2 -->
      <register>
         <name>DISABLE_XR2</name>
         <description>Disable Flash Page Exec/Read Register 2</description>
         <addressOffset>0x0158</addressOffset>
         <access>read-write</access>
      </register>

   <!-- DISABLE_XR3: Disable Flash Page Exec/Read Register 3 -->
      <register>
         <name>DISABLE_XR3</name>
         <description>Disable Flash Page Exec/Read Register 3</description>
         <addressOffset>0x015C</addressOffset>
         <access>read-write</access>
      </register>

   <!-- DISABLE_WE0: Disable Flash Page Write/Erase Register 0 -->
      <register>
         <name>DISABLE_WE0</name>
         <description>Disable Flash Page Write/Erase Register 0</description>
         <addressOffset>0x0160</addressOffset>
         <access>read-write</access>
      </register>

   <!-- DISABLE_WE1: Disable Flash Page Write/Erase Register 1 -->
      <register>
         <name>DISABLE_WE1</name>
         <description>Disable Flash Page Write/Erase Register 1</description>
         <addressOffset>0x0164</addressOffset>
         <access>read-write</access>
      </register>

   <!-- DISABLE_WE2: Disable Flash Page Write/Erase Register 2 -->
      <register>
         <name>DISABLE_WE2</name>
         <description>Disable Flash Page Write/Erase Register 2</description>
         <addressOffset>0x0168</addressOffset>
         <access>read-write</access>
      </register>

   <!-- DISABLE_WE3: Disable Flash Page Write/Erase Register 3 -->
      <register>
         <name>DISABLE_WE3</name>
         <description>Disable Flash Page Write/Erase Register 3</description>
         <addressOffset>0x016C</addressOffset>
         <access>read-write</access>
      </register>

   </registers>
</peripheral>



</peripherals>
</device>
